[
{"text": "\n    On my profile it states that I have a girlfriend (I do not) and are only looking for friends, it has worked wonders for getting one night stands.\n  "},
{"text": "\n    Hasn’t Tinder just become a parody of itself at this point? Like who cares if someone is on there just looking for friends — it’s the most populated app for meeting people near you\n  "},
{"text": "\n    Is this a "},
{"text": "\n    Current Votes:\n  "},
{"text": "\n    Most of them definitely aren't only looking for friends otherwise I think I would have been able to make plenty of them into hiking and backpacking friends and plan a fun trip (based on mutual interests in our pictures and profiles) instead of getting completely ignored because I don't have exactly the face, eye color, skin color, beard, etc. that they were looking for.\n  "},
{"text": "\n    If it's all a plot to not seem desperate, it's an extremely counter-intuitive one.\n  "},
{"text": "\n    \"I'm just bored TEE HEE\"\n  "},
{"text": "\n    \"Just here checking things out.\"\n  "},
{"text": "\n    \"Made this on a dare!!!\"\n  "},
{"text": "\n    Nobody is buying that, Lauras.\n  "},
{"text": "\n    Because dating doesn't have to imply that you're looking for primitive sex or marriage. Just move on from these profiles.\n  "},
{"text": "\n    It's also a bit laughable that you claim Reddit is a place to \"meet friends\", when most of these social media pages is a complete cesspool of violent and aggressive animals lol\n  "},
{"text": "\n    Just swipe left and move on dude.\n  "},
{"text": "\n    Lmfao are you that desperate and annoyed that you have to report profiles? Seriously?\n  "},
{"text": "\n    Looool I'm guessing you look for friends on tinder then?\n  "},
{"text": "\n    Ok sooooooo, I thought everyone knew that if someone tells you they just want to be friends, it’s a polite no. If they want you, they’ll let you know, regardless of whatever a status is. They are NOT on tinder to find friends. Period.\n  "},
{"text": "\n    There are also apps designed to meet people with common interests\n  "},
{"text": "\n    Exactly!\n  "},
{"text": "\n    out of personal interest, which ones? I'd give them a go.\n  "},
{"text": "\n    How do you make friends on Reddit? Who live near you? Maybe on like your city subreddit\n  "},
{"text": "\n    Yeah, but my city sub is too dead and small, I had to leap up to a city nearby's sub\n  "},
{"text": "\n    We call those \"attention whores\" where I'm from.\n  "},
{"text": "\n    Tinder is "},
{"text": "\n    \n  "},
{"text": "\n    I 100% agree that the useless \"looking for friends\" profiles take up significant space in the queue although it takes seconds to swipe left.\n  "},
{"text": "\n    Popular\n  "},
{"text": "\n    Popular\n  "},
{"text": "\n    You really think girls on tinder look for dates? They look for:\n  "},
{"text": "\n    Chads to fuck\n  "},
{"text": "\n    Beta orbiters to friend-zone them and maintain their self-esteem\n  "},
{"text": "\n    Beta bucks, which means men who are soooo desperate that they'll pay for women\n  "},
{"text": "\n    When they say \"they're looking for friends\", they're basically saying that if you're not Chad, they'll friend-zone you.\n  "},
{"text": "\n    Most downvoted comment is the most accurate.\n  "},
{"text": "\n    Funny, my best friend met his partner of two years on there. Maybe you're just a bitter loser without any real understanding of human relationships.\n  "},
{"text": "\n    "},
{"text": "\n    Don’t fall for that shit lmao\n  "},
{"text": "\n    females do that to filter dudes, nothing more nothing less.\n  "},
{"text": "\n    but yeah, get a 6 pack dude naked picture on your profil and see how the \" only here for friends\" turns into \" so when are you coming to my place hottie\" .\n  "},
{"text": "\n    I’ve seen these profiles. I’ve never had any luck with these girls but I totally took “just friends”  as friends with benefits. I’ve used tinder for a year, my mind is gonna blown if this is truly just to be regular friends.\n  "},
{"text": "\n    I have a tinder for fun, but even if I were looking for something serious, I would give absolutely no fucks about the ones looking for \"friends.\"\n  "},
{"text": "\n    If you aren't looking for the same thing, regardless of what the underlying reason is, then swipe left and move on.\n  "},
{"text": "\n    Problem solved.\n  "},
{"text": "\n    I'm sure there's people of any gender who's done this lol\n  "}
]