[
link: https://www.reddit.com/r/OnlineDating/comments/14e1dl5/girls_who_select_looking_for_new_friends_on_tinder/
subject: Girls who select Looking For: “New Friends” on Tinder:
{"text": "\n    Match group is stream lining all of their products. Tinder is one of their products.  This is an option on Okcupid. I believe it means that they are seeking friends.\n  "},
{"text": "\n    The question here is: if these are meant dating, then why have option for friends and for fun?\n  "},
{"text": "\n    Some women select it because that is how they want to start out the relationship. That way there is no pressure. At least that is what my female friend told me when she did it.\n  "},
{"text": "\n    OP ask a question to women and…a bunch of bitter men respond. Why?\n  "},
{"text": "\n    As a woman who has chosen that selection...it means I'm not going to jump into a relationship right away. I'm not seriously looking for Mr. Forever at the moment, I'm happy being single but I'm interested in meeting people and dating. If I happen to meet a great guy and all the sparks are there plus we seem compatible then I'd be open to more serious dating and eventually a relationship. I choose the friends option because I don't want there to be expectations put on me that if we go out for coffee or dinner and meet that we are now \"dating\".\n  "},
{"text": "\n    This theory of mine majorly backfired though. My last relationship started with me being pretty firm about wanting to only make new friends, and this guy was determined to change that very fast and make me his woman. It worked. Unfortunately that should have been the first red flag, he wasn't respecting my boundaries, but we ended up together on and off for a year and a half.\n  "},
{"text": "\n    B/c it was a theory that made no sense. It’s a dating app\n  "},
{"text": "\n    It means literally absolutely nothing, they are looking for Chad just as every other one\n  "},
{"text": "\n    I’d say it means they’re extremely easy to sleep with and they put it on there out of regret.\n  "},
{"text": "\n    Exactly right.\n  "},
{"text": "\n    I was looking for someone to friendzone, but then I realized that it's a dating site and I should just date. Hookups friendzone themselves, in my opinion.\n  "},
{"text": "\n    What do you mean by “hookups friendzone themselves”\n  "},
{"text": "\n    I thought it was a nice feature as it’s hard to meet people outside of work these days.\n  "},
{"text": "\n    I met a nice female friend this way.\n  "},
{"text": "\n    The guys didn’t seem to get it. I had to explain I met them as a “friend” and was not looking for more.\n  "},
{"text": "\n    Women put that on their profile to weed out dudes who get zero dates and proceed to ask:\n  "},
{"text": "\n    \"Girls who select Looking For: \"New Friends\" on Tinder:\n  "},
{"text": "\n    What exactly are you looking for and why do you select this? Are you looking for platonic friendships or something else? Have you made platonic friendships this way?\"\n  "},
{"text": "\n    Ooh aren't you just so clever and sassy. Well done\n  "},
{"text": "\n    It means friends with benefits. Seems kinda obvious\n  "},
{"text": "\n    Wouldn’t that be short-term open to long or short-term fun?\n  "}
]