[
{"text": "\n    If a another guy is buying you dinner, there is no way in their eyes they are doing it to be \"just friends\". No matter how much you state it they will be saying in their mind \"suurrreeeee\". No way your boyfriend can not be jealous at this.\n  "},
{"text": "\n    You sound nuts. You're being obtuse as fuck. Listen to the thread: tinder is not typically a place to make friends, it's not normal to do so.\n  "},
{"text": "\n    If your bf was smart, he'd break up with you. You sound like you're insane and almost trying your hardest to not admit you're looking for some strange on Tinder. Tinder is a dating app, that's the bottom line and people are looking to fuck. Even if they say they're looking for friends there are most likely some kind of predator who is lying to try to harm you in some way. Seriously you can even use Bumble for friends (there's a setting for that), but you chose Tinder. If I was your bf I'd leave you.\n  "},
{"text": "\n    So your post history says that you've realized you're polyamorous, and that you've talked to your bf about the idea of poly?\n  "},
{"text": "\n    That's why he doesn't believe you.\n  "},
{"text": "\n    ...Also it may have something to do with Tinder being a dating site.\n  "},
{"text": "\n    This guy does his fucking research.\n  "},
{"text": "\n    Get off my app...\n  "},
{"text": "\n    I think he may feel uncomfortable, because although your intentions are for friendship, most people use tinder for different reasons. There are many other social networking sites that you can use for friendship, and honestly tinder probably isn't the best one.\n  "},
{"text": "\n    I know if my boyfriend used tinder to \"make friends\" I really wouldn't be happy about it. So I can see where your boyfriend is coming from. Put yourself in his shoes.\n  "},
{"text": "\n    You know, there are actually apps aimed at making friends.\n  "},
{"text": "\n    Tinder is not one of them.\n  "},
{"text": "\n    Your BF's jealousy is justified. And you seem delusional and/or emotionally oblivious if you think you're in the right.\n  "},
{"text": "\n    Cheating slut confirmed. Makes me absolutely disgusted.\n  "},
{"text": "\n    I had the same problem, I used Ashley Madison just to make friends and my SO was very jealous of the fact I was on there. even though it clearly stated in my profile I was just there to make friends. I wouldn't consider our meet ups \"dates\" either it was just me meeting up with a stranger who might've been on the site for different reasons but I was there to make friends. So what if other people were hooking up or dating, I was there for friends. Not everyone on a dating app is looking to date or hookup some of us just wanna use the most inconvenient app to find friends. Even on NSA finder it clearly stated I wanted to be friends and my SO was still getting mad at me for having an account. Just doesn't make sense, I've expressed that I identify as poly too but she's not and even though I am, I'm not gonna see other people even though that's what I'd ultimately like to do. I made it clear that I wasn't gonna live my life how I'd like to because my SO isn't comfortable with it.\n  "},
{"text": "\n    how do I convince him Tinder is an option for making friends?\n  "},
{"text": "\n    Probably the same way you'll convince the Pope to wear an explosive vest and bomb an airport in the name of Islam.\n  "},
{"text": "\n    You have every right to make friends.\n  "},
{"text": "\n    You have every right to use tinder to do it, even though the app's reputation precedes it.\n  "},
{"text": "\n    However, you cannot demand that your boyfriend be comfortable with it. You cannot demand your boyfriend stay with you if you continue making friends on tinder. You cannot expect your relationship to continue, especially when he's voiced his concerns.\n  "},
{"text": "\n    Do you really think he's going to be okay with you using a notorious hook-up app (for WHATEVER purpose) after you've had discussions about polyamory and how he's not comfortable with it? Is that your expectation? Do you think it's realistic?\n  "},
{"text": "\n    IMO, you're just looking for justification. Either for yourself, saying that he's being irrational and clingy, or so you can throw it in his face when you (inevitably) have fights about it. Check yourself. None of this will turn out well.\n  "},
{"text": "\n    You should break up with him. You are not fully committed to the relationship by doing things that he us not comfortable with.   Most if not all of these guys you are going on dates with are going to try and sleep with you, even if they say they are not\n  "},
{"text": "\n    Your boyfriend sounds like an idiot for staying with you.\n  "},
{"text": "\n    Use bumble in BFF mode instead of tinder\n  "},
{"text": "\n    Oh also you've mentioned before you want to be poly in other posts and he's not cool with it. You obviously want to fuck someone else, just admit it. Break up with your bf and go fuck people, not judging you not saying to insult you, I'm literally just saying go fuck people cause that's what you want to do.\n  "},
{"text": "\n    giving him another gf would def make him chill\n  "},
{"text": "\n    though, there's nothing wrong with admitting looking for another guy or let the dude go.\n  "},
{"text": "\n    Tinder is NOT for making friends. It's an app specifically designed for meeting people to have sex with. If you're using it to make friends, you're doing it very wrong. Kind of like going on Pornhub to watch Pewdiepie videos.\n  "},
{"text": "\n    This bitch be crazy 😩\n  "},
{"text": "\n    Ayy, it's the cheating troll! Can't believe it took this long to post on "},
{"text": "\n    You use Tinder to make friends like I use porntube to learn how to fix a sink.\n  "}
]