[ --- Have you made legitimate lasting friendships with people you met on a dating app? ---
link: https://www.reddit.com/r/datingoverthirty/comments/u2r70q/have_you_made_legitimate_lasting_friendships_with/

/*
code: import scrapy
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from webdriver_manager.chrome import ChromeDriverManager
from selenium.webdriver.common.by import By
from selenium.webdriver.common.action_chains import ActionChains
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from scrapy.selector import Selector
import time

class RedditSpider(scrapy.Spider):
    name = "reddit"
    allowed_domains = ["reddit.com"]
    start_urls = [
        "https://www.reddit.com/r/datingoverthirty/comments/u2r70q/have_you_made_legitimate_lasting_friendships_with/"
    ]

    def __init__(self, *args, **kwargs):
        super(RedditSpider, self).__init__(*args, **kwargs)
        self.driver = webdriver.Chrome(service=Service(ChromeDriverManager().install()))

    def parse(self, response):
        self.driver.get(response.url)

        # Sayfanın sonuna kadar scroll yaparak tüm yorumların yüklenmesini sağla
        last_height = self.driver.execute_script("return document.body.scrollHeight")
        
        while True:
            self.driver.execute_script("window.scrollTo(0, document.body.scrollHeight);")
            time.sleep(10)  # Yorumların yüklenmesi için bekle
            new_height = self.driver.execute_script("return document.body.scrollHeight")
            if new_height == last_height:
                break
            last_height = new_height

        sel = Selector(text=self.driver.page_source)

        # Ana yorumları seçmek için CSS seçiciyi kullanın
        comments = sel.css('#-post-rtjson-content p')
        for comment in comments:
            text = comment.css('::text').get()
            if text:
                yield {
                    'text': text
                }

        self.driver.quit()

*/

{"text": "\n    I have not. I have found that when one party rejects the other for a relationship, it’s unlikely that the rejected person will truly be interested in a platonic friendship.\n  "},
{"text": "\n    Yes, well I don't know if it will last but so far it has. One guy I met had this amazing golden retriever energy, just fantastically fun. We had a blast snowboarding together, I let him crash with me after being extremely clear it was a crash not a smash offer. He was respectful. We made out a little bit over the next few times I saw him but didn't have sex. I was out of town for awhile and started dating someone else. We had planned to ride again with his staying with me but I told him I couldn't have him stay with me. He asked why, I told him I was seeing someone and he was super cool about it. We still ride together and have a blast, it hasn't been weird and I feel like we're going to stay legitimate friends. I think this only works because while we both had a blast and found each other attractive neither of us was super invested in dating each other and we didn't have sex.\n  "},
{"text": "\n    I met a guy on a dating app who I've now known for 4.5 years. We dated for about 6 weeks of that time (oddly, those 6 weeks were in roughly the middle of those 4.5 years, not at the beginning) and we continue to be friends today. I should point out that I've been using dating apps for around a decade and this is the only friendship that's ever come out of it.\n  "},
{"text": "\n    Nope. I've found "},
{"text": "\n    Over 10 years ago, I met my late wife on the old version of OkCupid.  Originally she was just a chat buddy and we never intended to meet because she lived almost 200 miles away and was 8 years younger than me.  Circumstances conspired to have us eventually meet, and even when we tried to just be friends we ended up dating and then moving in together.\n  "},
{"text": "\n    Before her, I met and dated several women through the old OKC in my own area without ever really connecting with anyone.  During that time, I was very active on the OKCupid message boards or forums of the time. I met a lot of people by socializing on there.  I eventually met several of them, even ones that lived on the other side of the country miles away at one point.\n  "},
{"text": "\n    To this day, I maintain social media and chat friendships with some of those friends from OkCupid, even though I never met some of them in person.\n  "},
{"text": "\n    Now that I look at dating and how much it's evolved in the years since then, I'm a bit at a loss. Everything is swipe left, swipe right, focusing purely on pictures instead of personality and communication.  I've read up a bit on it, and the general advice is to effectively get a makeover and hire a professional photographer to take good pictures of you for your profile so that people will swipe right on you and then maybe actually read your profile, otherwise you're not going to get even a foot in the door.\n  "},
{"text": "\n    Personally, I live in a small town with an insignificant singles population.  We moved here because it was a good place to raise a family.  Since moving here, my wife fell ill to cancer and passed, and my own health has declined to where I'm disabled and have limited opportunities to travel.  Having covid isolation thrown into the mix has made it that much easier for me to just not really consider trying to meet people or date.\n  "},
{"text": "\n    I've looked at various apps and services online, but it's pretty pointless because there just aren't really any single women in my area near my own age.  I haven't run across any platforms that allows the type of socializing that I was used to either.\n  "},
{"text": "\n    I’m sorry about your wife. Old school OkCupid was such a different experience. It’s that “old internet” that I miss so much. Sadly, now that everything has gotten so shallow and surface level, I don’t see it ever going back to real profiles and actually getting to know people 😢\n  "},
{"text": "\n    Actually, yes I have! It was on Tinder! I matched with a cop In my area and even though There was an attraction there between the two of us we just didn’t align that well together. We met 3 years again and now he’s one of my closest friends. He’s married now and I’ve been in a serious long term relationship.\n  "},
{"text": "\n    Generalizations incoming...\n  "},
{"text": "\n    This has been SUPER common for me with women in the LGBT+ community, as a bi woman.\n  "},
{"text": "\n    With men? Almost non-existent, outside of friends "},
{"text": "\n    I've also seen this way more common in certain subcultures like LGBT+, kink, poly, etc. The \"pool\" of people is a lot smaller, so even if you don't click romantically it's still nice to have friends who are part of your niche.\n  "},
{"text": "\n    Yes! I have multiple friends that I initially met through one of the apps.\n  "},
{"text": "\n    True friendships no. I tried to be friends with one and it backfired on me. I loved talking to him so reconnected thru dinner. He straight up asked me why I stopped dating him as I was taking a bite out of a burger. I thought I provided a respectful response and the conversation moved on. He ended the meal by hugging me and asking me to go visit a local attraction with him the coming up weekend. I was so excited to be doing something with someone outside of family!! It was a total revenge move on his part and I got ghosted lol\n  "},
{"text": "\n    That’s horrifying\n  "},
{"text": "\n    Yes, but it was a while ago.\n  "},
{"text": "\n    I dated my friend J for about 2 months after meeting on OKCupid approximately 10 years ago. Since then we've remained friends and she is one of my very closest friends. She was the witness at my wedding when I got married and has helped me navigate my divorce when it broke down.\n  "},
{"text": "\n    We weren't suited romantically but something in the OKCupid algorithm was right about our compatibility otherwise. However, the way it works now is totally different - an app didn't even exist when we met - and I'm unsure that these match percentages are anywhere near as accurate/reflective as they used to be.\n  "},
{"text": "\n    ETA: might be worth noting that as a lesbian, it's a fairly common and true stereotype to be friends with your exes. So worth noting that in my experience.\n  "},
{"text": "\n    Everyone who could intellectually take a step back and think she had the qualities to be a good friend I was interested in dating. At this point in my life, a boundary I have is to not be friends with women I want to date, so even if there is some friendship potential as well, I decline being friends in those cases.\n  "},
{"text": "\n    I currently have a \"friendship\" with one woman I've met on OLD, but part of me wonders if she still thinks we may end up as more.\n  "},
{"text": "\n    Every other woman I've met on OLD and tried to be friends with has been a bust.  Either faded, ghosted, or worse, an unhealthy dynamic.  I've had healthy friendships with women I've met on things other than OLD (even if we tried dating/fooling around and then stopped), but not the ones from OLD.\n  "},
{"text": "\n    Yeah same. Eventually the friendship fades, or the girl just ghosts one day. Usually when they get a boyfriend. It's funny because that hasn't happened with my female friends who I met in real life.\n  "},
{"text": "\n    Yes with the women. They seemed far more flexible about the outcomes and were always extremely communicative, even when expressing their indecisions and angst (seriously girl, thank you but like shut up)"},
{"text": "\n    Nope, even just yesterday a date that I was optimistic about (that I mention in the rant and rave section) said that she’d be up for meeting again just just as friends and I (politely) noped out of that. I wanted to date her, and still would want to. She didn’t want to date me and that’s OK. But deep down if I’m romantically interested, it’s not just going to stop subconsciously if we say “let’s just be friends”. Wouldn’t be fair to either of us.\n  "},
{"text": "\n    i've definitely made friends with men i've dated from the apps, usually started out dating and ended things on good terms or just realized you liked each other but not in a LTR kinda way. of course with exes, it's always good to have time apart after the initial breakup, but i have a handful of friends i've met on the apps that i consider pals now.\n  "},
{"text": "\n    Nope. Even if things ended on the best of terms with a guy, friendship is something I’m just not interested in. I have enough friends in my life, and as a parent who works full time it’s hard enough making time to maintain those friendships as well as dating. I just don’t have the time or the energy, or willingness really, to devote effort in cultivating a new friendship in that way.\n  "},
{"text": "\n    Yep!\n  "},
{"text": "\n    My best friend and I dated for 6 months or so.  Been great friends going on 7 years now.\n  "},
{"text": "\n    Depends on how you define lasting friendship.\n  "},
{"text": "\n    I have one ex that I exchange messages with every now and then but never actually see each other f2f\n  "},
{"text": "\n    Another ex we message more frequently and pre-pandemic would get dinner infrequently\n  "},
{"text": "\n    In my experience, most of the time it doesn't work to stay friends, I find that both parties have to resist the inclination to fall back into the old \"dating\" behaviours.\n  "},
{"text": "\n    Actually I did! I went on a date with this guy we previously chatted and talked on the phone for two weeks I thinkso the connection was already established. We both had a lovely time and after the date he said he's not looking for a gf and he's not really for a relationship but he would love for us to be friends. That was four years ago and he is one of my closes friends and wise versa. I think the key here was that he genuinely was not ready to date and was actually looking for a friendship not just saying it to blow me off.\n  "},
{"text": "\n    Goodness, I have a lot of male friends that I had dated in the past!  I’ve been divorced and dating for a decade, and that time I’ve established 8 friendships. While we started off as breadcrumbing after a few dates, it’s turned into sharing important events in life. Helping each other with computer issues, home improvements, elderly parents, and sewing masks. Haha. We do not have sex, but definitely check in weekly.\n  "},
{"text": "\n    What I ponder, is how none of them have had a relationship in the past 10 years, either. And how we can get along so well personality-wise, but they didn’t want to date or marry me.\n  "},
{"text": "\n    Yep. Two lovely ladies. One of them has become a good friend and we travel to see each other sometimes. The other I still hang out with and we do a lot of cooking.\n  "},
{"text": "\n    Of course there's still a bunch of people who ghosted me, but that's the risk you take with online dating.\n  "},
{"text": "\n    So i went of a few dates with a lovely lass as I was coming out of a really bad situation.  I thought I was fine but it was actually while trying to date this new person I realized I was incorrect, I was still messed up and not really in a position to date.\n  "},
{"text": "\n    Since then I've become somewhat friends with the new person. I no longer live in the same city but we both travel a lot so we've caught up when we are both in the same city.  She's a pretty awesome person so though I was 100% not ready to date her when we met I definitely wanted to stay in touch.\n  "},
{"text": "\n    Shit i did made frieds i think i am doing it all wrong\n  "},
{"text": "\n    Oh yes I have! I have three guy friends I've met from off the dating apps that I am still friends with today. Oldest friendship is about 9 years. Then 5 and 3. All of them I only had one date with and actually, the 9 years friendship one I was genuinely looking for male friendships cause I was with an ex at the time so we never actually went on a date. None of these guy friends ever went beyond platonic.\n  "},
{"text": "\n    I normally sense right away if someone is suitable for a friendship or not. Then I extend the olive branch if they would like to continue by being friends. I've had a couple of others that agreed to be friends where we hung out a couple of more times but it wasn't too strong and we just now mutual Facebook friends (both married).\n  "},
{"text": "\n    My girlfriends always find it fascinating I've been able to convert dates into friends but I have an outgoing and extroverted personality. And I always value getting to know people and friendships. I can generally sense if a guy would be the type of person that can have a friendship, without overstepping it.\n  "},
{"text": "\n    Yeah, not in the sense of we hang out every day and talk a whole lot, mostly because they live in different countries, but there's at least 4 guys I've met through Tinder that I consider friends and still talk to every now and then and would meet up with if they're in the area, in the same way as I do with other friends I've met traveling.\n  "},
{"text": "\n    And there's some around here that I have on social media and talk to every now and then and we're always happy to see each other if we run into each other.\n  "},
{"text": "\n    I have on Tinder but they only really lasted until I got engaged (to someone also met on Tinder). We were friends because we had something in common: single during lockdown. But once lockdown ends and people find partners elsewhere, it gets harder and harder to find common ground. A lot of the final messages I have from Tinder friends are them congratulating me on my engagement. And a couple Tinder friends I had to end things because they were more like “This isn’t the girl for you. You are making a mistake….”\n  "},
{"text": "\n    Yes, I have! I was FWB with one for a few months, told him I wanted to stop that, and we’ve been just friends for 5 or 6 years now. I’m really close friends with one of his ex girlfriends and I hang out with his current girlfriend too. I don’t think that’s at all feasible for most people, but he’s in the whole poly/open relationship scene. His partners knew how we met, knew that we were absolutely not interested in any sexual or romantic dynamic happening again, and I think because of that + their existing relationship dynamics, it’s been easier to keep that friendship.\n  "},
{"text": "\n    I have another friend who I met but never got romantic/sexual with that I hung out with consistently when we lived in the same city, and I still chat with him weekly. His girlfriend knows how we met and also is fine with it.\n  "},
{"text": "\n    I have several other people I’m pretty friendly with but not close to, if that makes sense. Like we’ll grab a random drink or go on a night out together within a shared social circle, but I don’t call them to talk about my feelings.\n  "},
{"text": "\n    I think the difficult thing about using a dating app like a friendship app is that 1) both parties have to be totally ok with friendship. It sucks to have someone catch feelings and become slowly resentful if they aren’t able to accept that something more won’t happen 2) if and when one of you gets an romantic partner and asks how y’all met, there is a potential for friction that isn’t there for like ‘through work!’ or ‘we met at so and so’s party and hit it off!’ Despite rationally knowing there wasn’t any romantic involvement, the initial base for the friendship may trigger some emotions that could lead to your friendship fizzling.\n  "},
{"text": "\n    I’d probably just use bumble BFF or be pretty flexible on what friendship would look like + disclose you want to be friends as soon as you know it’s not going to be romantic/sexual between you and the person you’re matching with.\n  "},
{"text": "\n    Love this answer. Once you get to know someone, you know them deeply. The connection cannot be severed until one or both decide to cut the cord. I believe there is a different level of human intelligence at work. I decided to not date about a year ago coming out of 2+ years of polyamory so I could concentrate on trauma healing. I let all my partners know. They’re still there, just not in the same capacity. But they hold me silently, with love and care. This business we carry on with in life where it’s either a relationship or it’s not, it’s bullshit. It’s a lie. Love who you want to love when you want to love them. Communicate openly. The rest will figure itself out.\n  "},
{"text": "\n    Yes but we dated for 1.5 years. She’s still my best and closest friend to this day.\n  "},
{"text": "\n    Yes! I met a guy through OLD, we went on first date, he liked me more than I like him, I friend zoned him, but he seemed to have a good time with me. The relationship grew and we became more than friENDS. We cared for each other and we were together for a while. We are from two different cultures. He is the typical indian software enginner and I am latina. Somehpw we took a different direction. I found a bf and he got married. We still stay in touch through messages and I know we both really care for each other. I would say it is possible! I want to add we have know each other for almost 10 years!\n  "},
{"text": "\n    I'm still new to dating and I'm non-binary demi, and I explicitly put on my profile, \"Looking for new people to connect with and do things as friends with potential to grow.\" And my matches have been similarly friendly. There's a fair amount of people in my suggested matches who aren't looking for a relationship either. We're working on ourselves, busy with life, not into integrating ourselves with another yet. Atm I have several new friendships forming. And being demisexual I need that friendship to form to ever be attracted to anyone romantically anyway so, it works out. And if I stay in the friendzone after X amount of time and I catch feelings, oh well. I have a friend still, I can let the feelings go. :)\n  "},
{"text": "\n    I have a good story for this one. The answer is yes, it happened only once but it happened. I matched with this girl and we hit it off really nicely, we seemed very compatible and we set a date. Unfortunately, while texting before the date, we realized we had an incompatibility which was a deal breaker for me. We said farewell after that conversation and I thought that would have been just another dead end. Instead, one night we met at the theatre, she approached me and we had a very pleasant chat. We decided to go for dinner together afterwards, in a very spontaneous way, and we decided to keep in touch as friends. And we are still very good friends to this very day! So yeah, it's rare but it can happen :D\n  "},
{"text": "\n    Yes, once. I went on a couple dates with a woman I met on Tinder once and wasn’t feeling it. She asked if we could still be friends and I said ok. Being friends with her has been fine years later and she even became friends with some of my other friends. I don’t think it’s something you should try to force though.\n  "},
{"text": "\n    Three of my friends... new country during Covid so friendship was scarce. Though one is acting salty that I have a bf now. Mainly online friends. Text between daily and weekly. But meet up once every few months for a catch up.\n  "},
{"text": "\n    All at least 1 year old. Oldest nearing 3 years.\n  "},
{"text": "\n    Don’t use OLD for friendship though... these three were because we liked similar hobbies or have similar ideas but emotionally we didn’t match and one his family didn’t approve of him dating a white girl. I have dated much more in this time and only had a relationship with one of those three.\n  "},
{"text": "\n    In a roundabout way, yes. I became friends with my boyfriend's friends, and when our relationship ended, I continued to hang out with some of his friends. I'm still in touch with him too, but only very infrequently and not really with the intention of developing a friendship.\n  "},
{"text": "\n    Yupp! One of my best friends is from a dating app. We kissed once many years ago but that’s it. I know it’s rare but I’m happy it worked out!\n  "},
{"text": "\n    I have, but I think it's WAY harder to do once you're past 30. I don't really suggest it to the people I go on dates with anymore the way I used to if a date didn't work out in my 20s but the person seemed cool. Nowadays it's only happened with people I've gone on at least several dates with so that we had a bit of a cadence already.\n  "},
{"text": "\n    I think it's really more of something you do in your 20s as well because you're more likely to be new to a place and not have an existing friend group.\n  "},
{"text": "\n    I could see if you had a niche interest like rock climbing, it might make more sense.\n  "},
{"text": "\n    Most of the time though I think it's good to focus on one thing - romance - if a friendship "},
{"text": "\n    I don’t use dating apps, but I absolutely have here on Reddit. Guys and girls, I’ve had dinner with a few, gamed, went hiking, seen movies, etc..\n  "},
{"text": "\n    You can find good people anywhere if you’re open to it.\n  "},
{"text": "\n    Yes, several times. When there hasn't been strong mutual attraction but we are having fun, things often develop naturally towards friendship.\n  "},
{"text": "\n    OK Cupid used to support this really well, because you could simultaneously be looking for a wide variety of different kinds of relationships, and you didn't need to pigeonhole someone before even meeting them.\n  "},
{"text": "\n    I miss the old OK Cupid and the culture around it... 😔\n  "},
{"text": "\n    I've (M) have made a few friends (F). Wasn't my intention but they were good people and we either didn't have a romantic connection or the distance/circumstances prevented us from dating each other.\n  "},
{"text": "\n    \"if they do it becomes a temporary friendship that slowly fades or completely disappears once they find the relationship they were looking for\"\n  "},
{"text": "\n    It is the case for me, a woman that I would speak on the fone everyday and we told our lives to one another. I didn't want to date her, not my type really and she had two children. But eventually she found a boyfriend and got married. I saw everything on instagram and liked her pictures, happy for her. But, off course, the friendship ended as soon as she got the boyfriend.\n  "},
{"text": "\n    Yeah.\n  "},
{"text": "\n    I have a good friend of about 16 years I met on POF way back. We used to hook up but as we grew up, we just stayed friends. We fight like an old married couple now but we've always kept in touch and see each other a couple times a year for lunch.\n  "},
{"text": "\n    I have made a few other friends too but we aren't as close or stay in contact as long. Most fade out or are short lived. I'd say I have maybe 5 friends I met drom dating apps that were not of romantic interest after we met and became friends instead. Whether they know thats how I felt, not sure but they don't seem to mind and are dating other people.\n  "},
{"text": "\n    Um as a guy I have tried this but the girls never follow up or they just keep me as a pen pal when they need advice or somthing.\n  "},
{"text": "\n    But just my experience\n  "},
{"text": "\n    no. i’m friends with a couple exes that i met on dating apps, and back when tinder had the “tinder social” feature we used that to make friends, but otherwise no. it is always weird for the person who is friend zoned to hear about the other person’s dates and new relationships. do not use a dating app to try to make friends.\n  "},
{"text": "\n    I did for a few months but the friendship did eventually fade. Nothing happened, just gradually stopped talking and hanging out.\n  "},
{"text": "\n    Though I was sad the friendship faded, I did enjoy the ability to get to know someone slowly and having it not be romantic from the jump. It felt like we were naturally feeling each other out and not jumping straight into romance (which has often been my experience with OLD). I decided to adopt a slower mindset more intentionally the last time I was on a dating app and met up with a guy. I communicated my approach with him and he seemed uninterested in a relationship if it wasn't strictly dating. I completely understand that but it did kind of bum me out. IMO, there's still something really enjoyable about being open to meeting new people, possibly being friends, and then possibly more.\n  "},
{"text": "\n    I’ve suggested it to women I’ve dated/met up with in the past on OLD, but it never led to any sustained friendship.\n  "},
{"text": "\n    My thought was that even if we didn’t end up having romantic chemistry in person, we had enough in common otherwise to hang out.\n  "},
{"text": "\n    Understandable though, I feel like the portion of the OLD population that is open to friendship is pretty small. Separating that mentality on an app that is meant for romantic dating is a fairly hefty proposition for a lot of people.\n  "},
{"text": "\n    I've never made a lasting friendship with someone that I dated and then we turned out to be better as friends, if that's what you mean.\n  "},
{"text": "\n    I've met a few people off of dating apps as friends and then we continued into a successful friendship. neither of us met with any other expectations other than to be friends. no secret desires to end up sleeping together etc. I think finding that is probably rare, since most people are not on dating apps to find friends.\n  "},
{"text": "\n    Yes. A casual thing I had with a guy a few years ago, we're now roommates. We were just friends for about 18 months in between, lots of common interests. It's occasionally gotten a bit weird, especially when we bring up dating and we'll say \"well it wasn't like that when...\" Or something, but it's never uncomfortable\n  "},
{"text": "\n    One that got fairly close. Despite the insurmountable dealbreaker (she never wanted kids due to parental trauma, I wanted to be a father someday), we bonded over a shared love of The Bachelor and cats and decided to meet up anyway. Plus it was in the middle of the pandemic, so it was good company. We had this going on for about two-three months, talking with each other almost every day, her coming over every week to watch Bachelor in Paradise/Bachelor GOAT specials and me coming to her neighborhood from time to time, sharing almost everything that friends would do, even our own respective dating journeys.\n  "},
{"text": "\n    What kind of started to end things was that for her birthday, we spent a weekend at Storm King and stayed at a hotel overnight together and ended up cuddling with each other, but no sex. I did tell her that while cuddling with her felt great (especially as a single guy living alone in a pandemic), this didn't change anything about our friendship for better or worse and it seemed like things were okay. That is until I shared another dating failure and she blew up on me. After a week of silence, she did admit that she developed feelings for me over time, despite the fact that we agreed that nothing would develop beyond friendship because of our long-term incompatibility. We decided to separate right after having that talk.\n  "},
{"text": "\n    Looking back at it, I would have loved to see the multiverse version of the whole friendship/situationship-lite if we actually agreed on the \"kids?\" stance, either me saying I didn't want kids either or her saying that she does. Heck, maybe even reverse where I didn't want kids but she did. Because outside of that, I could definitely see being in a relationship with her. Just a very interesting moment of time.\n  "},
{"text": "\n    Yes! I have with one guy. He realized he wasn’t in a mental place to date, so he was about to stop talking to me, but asked first if we wanted to be friends instead, and I said sure! That was last June and we still keep in touch! The only thing is I’m in America and he’s in England (it was a worldwide mbti dating app called Boo), but I did meet him when I visited England last Fall and we hung out twice. Nothing romantic or sexual, just good friends!!\n  "},
{"text": "\n    Yes, once. I was living overseas (in the us from Brazil) and started seeing this guy. After 2 months, on the timing of “so are we dating?” he accepted a job offer in MA (we were in IL) and was moving in two months, and we decided not pursuing a LDR but remaining friends. One month after he told me that I moved to CA, and he even drove me to the airport. Later that year he went to CA for work and we hung out as friends. Idk about him but I was legitimately seeing him as a good friend at that point.  This was in 2017, I am back home and we still talk as friends\n  "},
{"text": "\n    Only once, with a guy I met on Tinder. We both felt the same in the sense that we genuinely enjoy each other's company, but there was no interest in anything more.\n  "},
{"text": "\n    He's been dating someone lovely for several years and they plan to get married. We live about an hour apart so we don't hang out often, but we meet up every year to catch up and hang out for a few hours. It's great!\n  "},
{"text": "\n    I originally made my dating profile to just make platonic friends. I started using online dating around summer 2009 and I did make a handful of friends though honestly the longest friendship I sustained might have been 2 years. The main reason we were friends so long is because dating would have been a dead end as he was still in his 20s when we met and he wants children. We just had a lot in common interests wise and once he said to me \"we're basically the same person\". That said, I ended up having complicated feelings and I shut the door on the friendship and then he moved out of town.\n  "},
{"text": "\n    I really miss some of the short term friendships I made from using online dating because I didn't know a single soul in Portland and they helped me navigate my time in a new city, have fun and attempt to find the best pizza slice in town.\n  "},
{"text": "\n    Yes! I have a few guys I met on dating apps that I wasn’t compatible with romantically, but now consider some of my dearest friends.\n  "},
{"text": "\n    Just one. But we’re mostly online friends and occasionally talk on the phone.\n  "},
{"text": "\n    Yes. Two, in fact. One we dated for a few months and have been friends for several years since. The other we decided before we ever met that we were more friends material than romantic. We were friends for a bit and then roommates for 3 years, back to friends as they are just plain moving on and I’m preparing to move in with my partner. Both are completely drama free.\n  "},
{"text": "\n    Without anything happening between us? Yes, with a woman. We were both new in town and never felt the spark, from the beginning she suggested we chill with a group of friends. We’re still great friends years later.\n  "},
{"text": "\n    With men, we first had a relationship then realized we were better as friends. Still a lasting friendship. :)\n  "},
{"text": "\n    A few for sure. One of my best friends was someone I met on a dating app, but I was just a workaholic so it didn’t work out but, we’ve since become peas in a pod.\n  "},
{"text": "\n    The last one threatened to commit suicide because I didn’t reciprocate my interest towards her then told people I wasn’t sensitive towards her threats after I called a doctor for her and tried to calm her down by talking about her dog. Not sure this one is going to be salvageable\n  "},
{"text": "\n    I lost touch with him now but I did match with a guy once that ended up being a nice friendship. We lived in different cities and the age difference/different places in life meant we didn’t have any romantic chemistry. But we ended up being friends for a while.\n  "},
{"text": "\n    Same situation with a two different guys. We used to check up on each other periodically. They both got married. One of them actually reached out after and thanked me for being a really good friend. I didn’t realize it but when he had gone through a big break up, I had helped him get through it and not lose hope. He said he appreciated it. I think we’re still IG friends. Likewise, it was really nice that I could vent to him when I was struggling with things he could relate to or understand that no one else could.\n  "},
{"text": "\n    Sometimes, you just meet someone who you realize isn’t your person. But they can offer you perspective or be a good friend.\n  "},
{"text": "\n    Yes, surprisingly I have.\n  "},
{"text": "\n    Only one friend from years back. Dates didn’t pan out. She found someone, then hit me up a year later looking to reconnect, but I was in a relationship by then. Eventually we just became good acquaintances. Never had anything romantic. We chat randomly on social media still and catch up once or twice a year in person. Neither of us ever pushed for a buddy-buddy hang out all the time type of friendship though if that’s what you’re looking for.\n  "},
{"text": "\n    The biggest challenge was that some of my exes weren’t very happy about her. One even went as far as saying “for your future relationships you should be careful about having friends from dating apps”, but I’m not sure how to navigate that other than be transparent. I’m not going to just unfriend her. But I haven’t pushed very hard for additional OLD friends ever since. The friction just isn’t worth it. I feel like it’d set an awkward precedent for future relationships I intend to take very seriously.\n  "},
{"text": "\n    As far as making regular friends goes, I’ve found meeting people through hobbies to be much more effective and fun. You have mutual interest right off the bat and can align schedules and meet consistently and eventually extend to hanging out outside the hobby (eg dinner).\n  "},
{"text": "\n    Yes. I met someone in 2015 on Match and while we never kissed or had any romantic or sexual encounter we remain VERY good friends to this day.\n  "},
{"text": "\n    I also have another friend I met around the same time and while we did hookup a couple of times back then, there is no sexual or romantic tension with us now.\n  "},
{"text": "\n    In this day and age these are pretty solid, long lasting friendships.\n  "},
{"text": "\n    I have. We quickly realized we weren’t on the same page for dating but that we liked the same music, had similar sense of humor, and we actually both worked for the same university. Those few things in common formed a friendship. I started dating someone and he was happy for me and he has now started dating someone and I’m so happy for him. We text each other every few days to catch up or to vent but our conversations have never crossed a line. My boyfriend knows who he is and his gf knows about me too.\n  "},
{"text": "\n    Yes but the circumstances were unique enough that they prevented crossed lines. We met out of town at a themed restaurant when I was travelling with friends who didnt want to go, and he moved out of the country shortly after.  We send memes once and awhile,  or talk about games. Its a very lowkey friendship that is hobby oriented.\n  "},
{"text": "\n    Otherwise no,  and to be honest I already have a healthy social life so the idea of making friends with people off apps sounds exhausting.  I use them for a specific purpose and I dont want blurred lines\n  "},
{"text": "\n    Yes. I met a guy about 7 years ago. We dated for a bit (never slept together). I wanted more, he said he couldn't.. It ended up that he was widowed, so it became complicated. Went through about 6 months of tension - broken expectations - lots of communication. A real mess. We opted for friends with strict non sexual boundaries. Being on the other side of it all, we love each other (platonically) to pieces, but holy hell it took a lot of work and isn't for the faint of heart.  If either of us get lucky enough to find a partner we will surly be at each other weddings.\n  "},
{"text": "\n    There's a meme somewhere that talks about how you don't need to sleep with or date everyone you have chemistry with, instead you should just open a taco truck together. He and I joke that we should have just opted for the taco truck from the start. :)\n  "},
{"text": "\n    Lady here - i actually have 2 really good male friends from tinder.\n  "},
{"text": "\n    Yes, adults who recognized we get on well but the romantic spark just isn’t there.  We’re great friends, and it’s comfortable\n  "},
{"text": "\n    The last two girls I dated actually. Met both on bumble (dating I forget bumble has a friends and networking feature)I think? Weirdly enough in both situations they were only gonna be in town for 3 or 4 months tops. So we just enjoyed the time together and then when they had to leave it wasn’t on bad terms. they are probably two of my closest friends now funnily enough.\n  "},
{"text": "\n    That said, we met as potential dating partners first and foremost. Ngl unless you have it clearly stated at the top of your profile that you’re looking for friendships, it DOES bug me when I match with someone and they tell me they are only looking for friends. Like that’s obviously why most people are there, it’s still a dating app. And as a guy who only gets a match maybe once or twice a month, to be then told they only want a friend feels a little like a bait and switch and 9 out of 10 times I stop talking to them because that’s not what I’m here for.\n  "},
{"text": "\n    I have, although it wasn't the original intention.\n  "},
{"text": "\n    Back in 2003, I matched with a woman on OKCupid.  I was heavy into Argentine tango at the time, while she and her recently-ex-boyfriend had taken some tango classes, so we went out dancing a few times.  (It actually turned out that I had seen her and her ex a couple weeks prior at a sci-fi convention, where I noticed them specifically because they were practicing tango there.)\n  "},
{"text": "\n    There was some initial chemistry, but I didn't immediately pursue it because I had already booked a trip to Sweden for a first in-person meeting with a woman I'd been emailing back and forth with for several months.  After meeting in person, I decided to pursue the Swede, but the local woman and I remained close friends until I moved to Sweden in 2008.  We don't talk that often any more, but we do both make a point of meeting up whenever I visit the States.\n  "},
{"text": "\n    Yes. Sort of.\n  "},
{"text": "\n    A guy I kept coming across on and chatted to Tinder never resulted in a date. All the time we were talking, I kept thinking “I know this guy, I’m sure I recognise him”\n  "},
{"text": "\n    Few weeks later, went to the local nightspot and he was there! That’s where I knew him from. We got talking and we’ve been friends ever since. I see him and "},
{"text": "\n    I’ve found one actual friend through a dating app. Only real success I’ve had out of them. 😂\n  "},
{"text": "\n    i made a legitimate lasting marriage with someone i met on a dating app.\n  "},
{"text": "\n    10 years so far\n  "},
{"text": "\n    I’ve got a few, actually. For various reasons dating didn’t work out but we got along well enough that we made a concerted effort to remain friends.\n  "},
{"text": "\n    Not what I’ve been on there for, mind - but if I’m not feeling dating, but still enjoy someone’s company, I’m open to it!\n  "},
{"text": "\n    I met one of my best friends on tinder. We didn’t date, however, which is probably why we’re able to be friends. I met another friend, but we’ve lost touch.\n  "},
{"text": "\n    I personally have found that a lot of straight men have a hard time being friends with women, especially if you met them in the context of online dating. I’ve had some sort term “friends”, but most guys ghost out once they start dating someone.\n  "},
{"text": "\n    I do have one friend I met when OkCupid was in its death knell in 2018 and we’ve stayed friends, but we had kind of an odd short term relationship. We’re fairly close in terms of knowing a lot about each other, but don’t always talk a lot.\n  "},
{"text": "\n    I met someone when I was interviewing for a job in a new city/state 8 years ago. He became my BFF for years after living here. Sadly politics got ratcheted up during COVID and became a divide between us. We still talk but have grown apart.\n  "},
{"text": "\n    Met two of my best friends on Tinder\n  "},
{"text": "\n    I met a guy on bumble and the day before our date he canceled because he had a lot of personal drama with his ex. We continued to chat as friends and spoke in such an open and pressure/expectation free way that we forged a great friendship before we ever met in person. It has been a little over a year and we are both in happy relationships but I still have long text conversations with at least once a week.\n  "},
{"text": "\n    I think i just lucked out and do not expect that this happens to many people.\n  "},
{"text": "\n    I met someone who was not a viable partner for me due to distance. We continued to chat intermittently via text for 5 years and I ended up setting him up with someone I know who lives closer to him.\n  "},
{"text": "\n    Yes its possible after you sleep with them first lol\n  "},
{"text": "\n    I'm assuming you mean friends of opposite sex? Growing up I always preferred to hang out with the guys, I was bored going shopping with the girls. But in relationships I've sort of stepped back from hanging out with guy friends (as they've gotten girlfriends too). I've recently joined dating sites and started chatting to guys I have hobbies in common with..some I think I could be friends with....but I think most guys go on dating sites for a relationship or hook up so probably not looking to make female friends.\n  "},
{"text": "\n    Yes! I met someone and we just really clicked when we started messaging. We were so similar and had SO much in common, I remember thinking I’m going to be really sad if this doesn’t work out, because I just really enjoy him as a person. Well, about 6 years later we’re still really good friends. We never dated after our initial date, neither of us had romantic feelings toward each other. But luckily we stayed close! We have even traveled out of the country together. He has a serious girlfriend who he lives with now, but luckily she is cool with our friendship. Definitely the best thing I have gotten out of these silly dating apps!\n  "},
{"text": "\n    I've met several people on dating apps that have become long term friends and hopefully lifelong. In every scenario, it's been meeting with romantic hopes/intentions, a few dates to get to know one another which builds basic human connection, followed by realizing there isn't a romantic avenue as agreed upon by both parties. This has resulted in very close friendship numerous times over the years. I'd wager in scenarios where 1 party IS romantically interested OR if lust is addressed BEFORE genuine human connection, it'd be more tricky.\n  "},
{"text": "\n    In 2 years I’ve met one person that I’ve “remained friends” with, although I can say it is a close friendship, and honestly it has mostly hinged on running into each other randomly. Once at a community volunteer event and again at a work type event because we work in similar circles. We have “met up” once more during a big public event in town. So while I do believe it’s possible, it is not common\n  "},
{"text": "\n    Friendships yes, marriage material no\n  "},
{"text": "\n    I'm friendly with a couple of them. One is a favorite. I do like flirting and we do have chemistry but we also didn't see a relationship. It was an odd occurrence where both parties were like \"this was great, you are great- but also something is missing\". Can't have hard feelings about someone feeling the same ya know? But I think that's the only reason we get along now. Maybe we just have great platonic chemistry. No idea.\n  "},
{"text": "\n    The other ones aren't as easy because there was one person with unrequited feelings (some me, some him) in each of those equations and that makes it harder to cope. But if things ended on a positive note and I think they helped me grow somehow in the process I won't block them and I'll stay connected on social media. It depends on how they made me feel during and after our experience.\n  "},
{"text": "\n    Yes, actually! Met my friend on Tinder about 9 years ago, went out once and realized there was no spark, but we had a lot of common interests and kept in touch. Friendship grew from there and I attended her wedding last October.\n  "},
{"text": "\n    Yeah definitely! I’m still really good friends with at least 3 people I met where we didn’t click romantically after a few dates. I dated one of them for like 4 months and it didn’t work out but we stayed friends.\n  "},
{"text": "\n    I met my best friend on a dating app nearly eight years ago. It honestly helped that there was a direct correlation between how well we knew each other and how romantically attracted to each other we were (the more we got to know one another, the less romantically attracted we became).\n  "},
{"text": "\n    We’re basically family at this point — we have been there through every shitty situation imaginable,  and she’s going to be the best woman at my eventual wedding. If either one of us started dating someone who had an issue with our friendship, it would be a dealbreaker.\n  "},
{"text": "\n    All that to say, it’s very possible, but it takes a lot of work to make the friendship last and get it to a point where it’s strictly platonic and neither party thinks about the other romantically or sexually.\n  "},
{"text": "\n    I'm working on at least one woman I had gone on a few dates with, went to a fun board game day with her friends some time after we parted and had a good time. I tend to swipe on people with a lot of mutual interests so the transition felt natural.\n  "},
{"text": "\n    No, I have only had one friend in my life who was a girl and that friendship ended terribly, so no... There are women I have met where I would say I am friendly with, and if i saw them in public I certainly would say hi and not be rude, but an actual friend? no\n  "},
{"text": "\n    Yeah in November I swiped on someone who had similar Spotify picks (mine are pretty rare for my area). I didn't think we had anything in common other than music. She matched and messaged me saying she didn't want to date but wanted to be friends.\n  "},
{"text": "\n    We go to shows together and share music we find pretty often.\n  "},
{"text": "\n    I have another Tinder hookup who turned into a friendship later on through circumstances.\n  "},
{"text": "\n    It can happen, but it's more rare than dating someone.\n  "},
{"text": "\n    No.\n  "},
{"text": "\n    If it happens incidentally then that's great and I do know people who have ended up friends with someone they had a date with or whatever, but I think if you're actively seeking friends then IMO you're better off focusing on methods other than tinder. Most lasting friendships are built through repeated contact and shared experiences, whether that's school, uni, work or groups associated with passions/hobbies/interests or whatever, not dates that didn't go anywhere.\n  "},
{"text": "\n    Yep! And to be fair, 2. Out of 2 years of dating apps, so it is not common at all imo\n  "},
{"text": "\n    yes, made a great friend but she was in an open relationship so I think was totally happy with the fact we didn't end up in a romantic situation\n  "},
{"text": "\n    most women I meet through apps are into me but if I end up preferring to be friends they kinda go sour on the idea\n  "},
{"text": "\n    I have yes, met a girl on a dating app. We dated for about 2-3 months then she moved as she was only in my city on a temporary work contract. We maintained a friendship and still communicate. Met her approximately 4 years ago. Haven’t seen her in person since she left my city.\n  "},
{"text": "\n    Yep! I've made a dear, dear friend with someone that I had initial chemistry with. We gave it a shot and it didn't work out but we've since become really close friends and I just cherish her!\n  "},
{"text": "\n    Nope doesn’t work I’ve tried that with ones who I weren’t interested in relationship wise as a nice way to say I’m not feeling this romantically. Now a days I don’t think that’s even possible.\n  "},
{"text": "\n    No, Unfortunately I have not.\n  "},
{"text": "\n    Yes!! But with a big caveat.\n  "},
{"text": "\n    So, one of my best friends now, is a girl who I originally net on a dating site. We caught up for a date, had a reasonable time but I think we both realised that there wasn't romantic feelings there, bit we still thought each other was cool and interesting.\n  "},
{"text": "\n    So we kept in touch via IM's (this was like 2005), occasionally seeing each other online and chatting a bit. About 4 years later, we were msging one night and she said \"you should come up and visit\". She'd gotten married in the meantime.\n  "},
{"text": "\n    So I said \"ok sure\" and went up there.... and we've been best friends ever since. Her hubby is also now one of my closest friends, and I ended up dating her sister a number of years later.\n  "},
{"text": "\n    Apart from that, I have one other very close friend that I met on a chat program called ICQ (anyone remember that??). I would've approached her to try and date her originally, but I found out that she was like 12 haha - I was 19, so it's not quite so bad! And she's always been extremely mature for her age!\n  "},
{"text": "\n    "},
{"text": "\n    Became mates after one date and then 4 years of occasional chats on IM apps\n  "},
{"text": "\n    Or\n  "},
{"text": "\n    2. Became mates because girl was unavailable for some reason, thus removing sexual tension from the equation.\n  "},
{"text": "\n    Yes\n  "},
{"text": "\n    Way back when OKC allowed you to freely search and had forums and stuff I did a search for my highest match in the country. She lived way away from me but we started talking and eventually exchanged numbers.\n  "},
{"text": "\n    I've gone to meet her and we talk everyday. I would actually be interested in dating her, but I don't think she's interested plus there's the distance thing.\n  "},
{"text": "\n    I'm proofreading the PhD thesis of a woman I met on tinder in January. It's for fun and to help.\n  "},
{"text": "\n    That's all I've ever gotten from dating apps- friends. Not knocking it since friends is cool, but finding a date might be a welcome change one of these days.\n  "},
{"text": "\n    I have.  Took years to get out of the still-pining stage on my end but thankfully I always kept that on the low.\n  "},
{"text": "\n    Yeah!\n  "},
{"text": "\n    I fumbled my phone and accidentally super liked someone.\n  "},
{"text": "\n    I was all “uh oh” but figured nothing would come of it.\n  "},
{"text": "\n    But he messaged me back by name!! It was someone I knew. But I didn’t remember him at all.\n  "},
{"text": "\n    So I showed his picture to my friends and one was all “yeah that’s Ben. We went to school with him”\n  "},
{"text": "\n    So I was all “hi!” And played it off. We had a nice time chatting so we agreed to meet for coffee.\n  "},
{"text": "\n    We met and he said that he remembered that I like Tennis, that he had seen me at church and that I was quiet in class, but that he didn’t think we’d ever spoken to each other in our lives!\n  "},
{"text": "\n    So I explained the super like and he said he figured it was something like that because no one ever likes him.\n  "},
{"text": "\n    Well we had a good time and decided to be friends. We meet for coffee every week and have gone in together on a pickle ball set. When things dry out we’re going to start playing.\n  "},
{"text": "\n    Anyway, he’s a nice guy and a nice companion and I’m glad my finger slipped\n  "},
{"text": "\n    Queer woman here. For sure!\n  "},
{"text": "\n    I have a few friends I met on apps. One of my best friends and I met, had two dates, agreed we didn’t have romantic chemistry but though each other was cool. Now three years later she was the first friend I called to help me process a traumatic thing.\n  "},
{"text": "\n    I have a few other friends that I dated a bit more that I’m still close with, though not "},
{"text": "\n    I’ve met people I thought were good friends but sooner or later you end up realizing there is a one-sided crush going on. Sometimes it can really catch you off guard.\n  "},
{"text": "\n    I have two long-term friends I met on dating apps. We lived kinda far but matched when I was traveling. I’ve met one but the other is p much an Internet/social media friend. We have a lot in common but between distance or whatever, we haven’t dated.\n  "},
{"text": "\n    Yes. Over a year ago I met a guy on Facebook dating, we hit it off amazingly well but after a few dates realized that we weren’t really a romantic match. Personality wise we are super compatible and while hanging out one night he told me that he thought I was his best friend. And I am. I now consider him to be one of my best friends.\n  "},
{"text": "\n    I haven't, although that isn't to say I'm completely opposed to it. In most cases though if I match with somebody on a dating app I find them attractive, and if they have a personality I'd want to be friends with then you have friendship + attractive and that is pretty much what a relationship is to me, so I'm generally not going to want to be just friends.\n  "},
{"text": "\n    Sort of! One time. The first couple dates went fine but the connection wasn’t there. Or maybe the connection was there but we were on different pages in our lives? Either way, we keep in touch, text, follow each other on social media, make the occasional plan to hang, etc etc. Who knows what’ll happen in the future but I’m happy to have another friend!\n  "},
{"text": "\n    no. ive had several friendships form, but for some reason or another we stopped talking after awhile.\n  "},
{"text": "\n    21 m and she was a 19 f . Lasted a year and a half. At our age I think that’s pretty decent especially considering I kept with her during her first year in college and through a 1 month trip to France which hopefully she didn’t cheat on me during.😂\n  "},
{"text": "\n    Not really.  Everything usually just fades out once we determine we're not a romantic match and I'm not good at maintaining friendships with exes.\n  "},
{"text": "\n    Currently there is one woman I went on two dates with that really wanted to remain friends.  I'm trying but it feels so forced.\n  "},
{"text": "\n    I have.  Two of my friends I met and dated through OKC, even though the relationships didn't work out we've stayed close friends for 12 years and 8 years respectively.\n  "},
{"text": "\n    I have, 3. All guys who i got on really well with and had a sort of fwb thing that just turned into really good friends over time.\n  "},
{"text": "\n    One is my ex wife and parent of my son!  I dated a woman for about 3 months and we still get together for lunch. One I've never actually met in person, but we've been sending dumb pictures of our cats to each other for like 2 years.\n  "},
{"text": "\n    I met someone via dating site in 2007.  We are still friends today.  We have hooked up, but I think knowing that we aren’t each other’s “relationship material”- as we live very different lifestyles, etc.  We decided to build a friendship, and it worked for us.\n  "},
{"text": "\n    I think if you are open to it, you can find people to be friends with.  I do think it can be really difficult for some if one has a jealous personality, you need to be willing to actually be friends- no hidden feelings (this means being able to discuss dating/relationships.)\n  "},
{"text": "\n    I have\n  "},
{"text": "\n    I've met a few. Being in the Navy people come and go, but I have a few I met in tinder that have moved to other bases that I will see, friends only, when I'm in their area.\n  "},
{"text": "\n    good friends? no. But there is one guy who I met on Tinder way back like 6-7 years ago who I'm still kind of friends with. It wasn't on purpose though. We had maybe 4 dates and made out once or twice and things just sort of fizzled. But then we kept running into each other like at concerts and stuff. And we had tons in common... mostly music and entertainment interests. So we have occasionally gotten together again. We've been to a few concerts together. He came over and watched some new episodes of a TV show we both liked. I went to a house party he had. Not a super important friendship, but it's there nonetheless. He's a good dude.\n  "},
{"text": "\n    yes,  absolutely. one of the girls I met on tinder has become one of my closest friends to this date.\n  "},
{"text": "\n    Once.\n  "},
{"text": "\n    I dated this guy I met on bumble for about 3 months before he broke it off. When we met the first time, it was like we'd known each other our whole lives. Instant banter, comfortable around each other, just an easiness I'd never experienced. I was obviously upset when he ended it and we didn't talk for about a month. I thought about him every day. I called him one day and we instantly said how much we missed each other in that month and he expressed how much he would like it if we could be friends but he also understood if I couldn't do that. I decided I would rather have him as a friend then nothing at all. Last month we celebrated him and his fiance having their first child together and I'm so happy I get to be a part of that with them. (Side note, his fiance is much better suited to him and I will forever be thankful that she welcomed me into her life as well) So basically, I got 2 friends and I'm an honorary aunt just because a date didn't work out. How lucky am I?!\n  "},
{"text": "\n    No for me too.  I tried with a couple of girls, but it never really took off once we just wanted to be friends.  And the other girls I either slept with, dates, or we just ended it right then and there because we both didn't feel it on the date.\n  "},
{"text": "\n    I did date a guy off tinder and when we called it off (early on), we stayed firm friends. Sadly the dating was throughout a very bad mental health period for him, and about 8 months after just being friends he ceased communication after another breakdown. Had it not been for the mental health aspect, I do believe we would've stayed firm friends, but that is an unusual case.\n  "},
{"text": "\n    And to note - he called off the friendship with me, to work through things alone. I did not call it off with him because of the mental health issues.\n  "},
{"text": "\n    Yep! I met one of my closest friends on tinder. We dated for a couple weeks. He’s poly, and his main girlfriend at the time was awful and I just couldn’t deal with it so broke it off. We maintained a friendship though and 4 or so years later I’m still here and she’s long gone, thankfully.\n  "},
{"text": "\n    Met another good friend on tinder as well. She had a profile set up for her and her husband, but also said she was interested in just making friends so I matched with her and told her I didn’t have an interest in being a unicorn but could see about being friends. We’ve developed quite a lovely friendship!\n  "},
{"text": "\n    Yes. 1- We went kayaking, and then she took me to a really nice restaurant. (She warned me to bring a change of clothes) I knew she was outdoorsy so I made her an Altoids survival kit as a little trinket to remember our first date. She walked me to my door when dropping me off and said that she had a great time and then almost in unison we said \"but I don't feel any chemistry\". It was a v wholesome interaction and we were hiking buddies for several years after before she moved for school and then became busy with health concerns. Still talk to her through Discord and Facebook regularly.\n  "},
{"text": "\n    I've met a few people on tinder that have only been and still are really good friends of mine. Granted it's not what I went into it for, but it's what I came out with.. 🤷🏼‍♀️\n  "},
{"text": "\n    You mean you haven’t gotten only bots?\n  "},
{"text": "\n    Yes I've met friends on dating apps, I usually know after the first date if the person is someone I want to seek a romantic/platonic or a non relationship with.\n  "},
{"text": "\n    One of my closest guy friends was someone I met off an app a few years ago. I think what was key for us working was there wasn’t ever a romantic spark for me. I dated him after a terrible ex and he was a 180 from him, which made me feel he was a guy worth keeping around. When it was ending, I was terrified of losing such a good person. Thankfully, as I suspected, he really was a gem and graciously was on board for us to transition into full friendship. I’m very grateful for him!\n  "},
{"text": "\n    Yea, I met a girl on Tinder in October 2021, chatted for a month and then went on 1 date. Mutually decided we weren’t compatible (age gap and differences on kids), but kept texting. It’s now April and we’re still friends. It’s kinda nice getting the opinion of someone 10 years younger than me sometimes. She’s a good person.\n  "},
{"text": "\n    One person I met on tinder is now the dungeon master for the current DnD campaign I'm in for me and a couple of friends. It can happen. The first date was awful, but he turned out to be a great friend and DM\n  "},
{"text": "\n    Hasn’t happened. Seems like if there wasn’t enough interest to be romantically involved, there’s not enough for a friendship either.\n  "},
{"text": "\n    Yep, definitely a handful.\n  "},
{"text": "\n    Ye, I moved from AZ right before she was moving to the exact same city so we hung out for a summer and it was legit.\n  "},
{"text": "\n    We still talk and I hang out with her parents sometimes and babysit their dog lol\n  "},
{"text": "\n    Yes. Almost a year ago I matched with a guy on OKCupid. I am monogamous, but he was in an open, long-distance relationship. We agreed to meet as friends. Although there were some sparks early on, I reiterated that I was not interested in a non-monogamous setup so we both re-committed to being platonic. Today it's absolutely one of my favorite friendships. We spend a lot of time together and it feels way more comfortable now that the sexual element has been removed.\n  "},
{"text": "\n    Not super long lasting yet but it’ll get there I’m sure. We met about a year ago on bumble. We met and hit it off pretty quick. I thought we were going to get together because she always wanted me over and jumped right into the romance and sex.\n  "},
{"text": "\n    When I finally asked her if she wanted to be together, we talked and she was looking for something else long term. Basically I have a kid and she doesn’t ever want them, or anyone else’s. Which is cool, I understood that.\n  "},
{"text": "\n    She wanted to keep being FWBs though, so we did that for a while. We’d continue dating other people, take breaks on the sex when we found one we liked, and continued after the inevitable breakup.\n  "},
{"text": "\n    After a while, she found a more serious boyfriend. By the time they broke up, we decided not to have sex anymore because we’d become such good friends. I miss it sometimes, but I was able to hold off on catching feelings again after we decided to just be FWBs anyways so it wasn’t a huge deal.\n  "},
{"text": "\n    Now we still talk like everyday. Give each other advice on dates, people, and just general life stuff. She’s the person I go to when I go through a shitty breakup or something, and I’m the one she goes to in the same situation.\n  "},
{"text": "\n    Looking back, I’m glad we didn’t get together. It wouldn’t have lasted as long and making a real friend is harder for me than getting a date anyways\n  "},
{"text": "\n    I've made a few good friends. One is actually my roommate now lol\n  "},
{"text": "\n    I made four text friends from Bumble. I still talked to two of them almost daily. We rarely meet up irl though.\n  "},
{"text": "\n    Yep! A couple, actually. One guy I casually dated for about six months before the romantic dynamic fizzled out, and now we're actually real friends. Two other guys I keep in infrequent, but definitely really friendly, contact with.\n  "},
{"text": "\n    I met a woman on tinder a couple years ago. We started out as friends from the start with maybe some hookups every now a then. We did everything together frequently including hiking, going to the movies, BBQs, etc… we eventually slowly but surely faded apart and I haven’t spoken to her in about 2 months now by choice.\n  "},
{"text": "\n    She just became very distant and started ignoring me when she found new, I guess better friends. She stopped reciprocating my energy entirely and I have a rule about not putting effort into folks who never return it. Not gonna force someone to invest in me, I want them to want to invest in me.\n  "},
{"text": "\n    I've definitely had some good lasting friends on dating apps.\n  "},
{"text": "\n    I did a lot of solo travel so dating apps were sometimes a way to find people to do things with.\n  "},
{"text": "\n    One instance we both had something in our profiles about Excel and clicked pretty well. Didn't end up meeting up then, but was on a couple of long trips and met up with her twice?\n  "},
{"text": "\n    Even let me crash at her and her BF's place one time flying through on a stopover. After the first missed connection just thought it was going to be a very friendship based relationship.\n  "},
{"text": "\n    Super cool chick though.\n  "},
{"text": "\n    Why not just use bumble bff?\n  "},
{"text": "\n    I've made a few but it was long before tinder, when online dating was very different.\n  "},
{"text": "\n    I have. One friend I see once in a while (we live far across town from each other) and have known him/been pals for about 7 years now- each going through other relationships. And I have another friend I see a lot more of, and chat with regularly for the past three years, each going through other relationships\n  "},
{"text": "\n    yes stayed friends with one guy i dated briefly.  wasnt looking for that, it just kinda happened naturally. I dont think its something you can force, and if you go into dating looking for that you may end up disappointed.\n  "},
{"text": "\n    Several! One of my closest friends is just a rando from Tinder. Been friends since 2015 or so now!\n  "},
{"text": "\n    I am not really into friendships so doesn’t work for me.\n  "},
{"text": "\n    Yes! I went on a great date with someone in a different country - about 2000-2500 miles from where I lived and we ended up staying in touch and becoming friends over the subsequent 7 years. I caught up with him last week when my husband and I were visiting Vancouver for a week. Otherwise, no, any friendships that followed after datingship or relationships ended lasted maybe a year or 2 and fizzled out. Technically I'm \"friends\" with my husband's friend who inadvertently introduced us (after we went on dates, I asked to just be friends), but in the last few years, he's not been a great friend to my husband (whom he's known since middle school) and turns out is quite aggravating and annoying so idk if that's a friend-- more an acquaintance whom I went on a couple dates with years ago.\n  "},
{"text": "\n    yes, my twinsies... aka birthday bestie..\n  "},
{"text": "\n    I have made a couple of friendships. One is closer than the others. I met him on OKC a little bit less than 12 years ago. We started out seeing each other, I was more into him than he was into me, he moved away but visited the area enough that we morphed into FWB, I moved and ended up being closer to him (he was not even a factor in my decision to move) and continued FWB who don’t see each other that much but talk regularly for another 3 years. He then met his now fiancé and we transitioned to platonic friends. We backed off communication a lot for the first year or so of their relationship (she lived close to me and I didn’t want to cause any issues for them, plus I had to fully get over my own feelings that had always been lingering). We then gradually regrew our platonic friendship  over the past five years and now he’s one of my closest friends and the relationship is completely platonic (we have the same sense of humor and are both super competitive so that’s what allows us to get along).\n  "},
{"text": "\n    I have gotten a few other friendships over the years, however they tend to fizzle after someone gets in a relationship.\n  "},
{"text": "\n    I have!\n  "},
{"text": "\n    I am female and typically make male friends more easily than female ones, so I wound up on a lot of dates with who were my “friend type”. Most of the time I didn’t want to ask if they just wanted to be friends in case they found that insulting, but one if them it just kind of organically morphed into a friendship. We still talk a lot and became genuinely close. The other told me he was only looking fwb and asked if I was down, a said no and he asked if I wanted to be friends. We have dinner every now and again.\n  "},
{"text": "\n    Honestly most of the connections I made on dating apps would have been better suited as friendships, and I wish there was a way to say that without it seeming like a consolation prize or polite rejection.\n  "},
{"text": "\n    Yes! I met one guy who rejected me after the first date because he wants children in the future and I’m done having him. He was so respectful in that, and we’d had such a good time, that I asked that we remain friends. He was new in town and came to Thanksgiving at my house that year 😂 He’s now dating someone else but we still schedule hang time at least once per month.\n  "},
{"text": "\n    Another I met and we had a great 10 hour adventure together in our first meeting and immediately decided to be friends. We became weekend drinking buddies and he introduced me to the person I’ve been seeing for the last four months.\n  "},
{"text": "\n    Yes I have met friends through apps and then met friends through them.\n  "},
{"text": "\n    I see dating apps as just a way to meet ppl - yes most use it for dating, but I see it as people go on there and look for whatever they want- friendships, hookups, fwbs, serious relationships.\n  "},
{"text": "\n    I think this might be unconventional, but I've had very long stable fwbs before I got with my current partner.  Those fwb are now just friends.\n  "},
{"text": "\n    I always emphasized at the start that fwb has \"friend\" in it, meaning you are a friend even if the benefits disappear.  My previous fwbs are now just friends and I've met friends through them. We talk just like any other friends - asking advice about life, jobs, dating, etc.\n  "},
{"text": "\n    I've also straight up met friends from dating apps. Would say I'm not interested for whatever reason but if they're interested in friendship then cool.  If not also cool.\n  "},
{"text": "\n    It's hard to meet new people, so I think it's great I've met people in this way. I will note that most of these friends aren't the kind of friends you see often but more \"catch up now and then\" friends. \"Send funny memes\" friends.\n  "},
{"text": "\n    I met my best friend through OLD a few years ago. We dated for 3-4 months then broke up but enjoyed each other enough to continue a friendship. It has been difficult at times but we have made it work and the hard times actually bring us closer together. I value him more than most people in my life. It  can happen!\n  "},
{"text": "\n    Yup, met a woman who happened to be travelling through my town while she was living her best nomadic life. We hit it off pretty well and I went to visit her a couple of times in the random places she ended up. It wasn't meant to be but was good while it lasted. We've been in touch ever since. Nothing crazy nowadays, comments on IG photos and the occasional text session or phone call about once a month. She and her husband are planning a visit this summer and I'm looking forward to it.\n  "},
{"text": "\n    Definitely\n  "},
{"text": "\n    Two of my best friend are guys I met on tinder, but after a few dates realized we were better as friends.  It's been years and we still talk almost daily.\n  "},
{"text": "\n    My two closest friends that are women are women I’ve met on dating apps.\n  "},
{"text": "\n    One I’ve kept in touch with for about 5 years. She got married since then and now I hang out with her and her husband and think they’re both great. The other I text nearly every day and have known for about two years.\n  "},
{"text": "\n    That said, its difficult to do. I’ve always been someone that kept things in a dating or bust realm so they were the ones that took the initiative and persisted on the friendship at the start so I’m going to say that it tends to be more at the woman’s discretion than the man’s.\n  "},
{"text": "\n    Yes, my husband.\n  "},
{"text": "\n    Lasting friendship I wouldn't say so.\n  "},
{"text": "\n    I do have one girl who I still talk to this day, but we aren't necessarily close.\n  "},
{"text": "\n    Surprisingly I have, with one male friend I met on Tinder. Right around the time I started chatting to him, he was dating the woman who is now his wife, so he gushed about her and it made it easier to connect on a platonic basis. I now have dinner with both of them from time to time and it's a really nice dynamic, but rare to find.\n  "},
{"text": "\n    I also have a long-term female friend I met through a dating app and we had a situationship for a few months, but we weren't compatible and are much happier as friends. Overall I think these situations are more the exception than the rule, though. Right now I feel socially saturated and while I deeply value friendships, I have a hard time making room in my schedule for more.\n  "},
{"text": "\n    I met my current best friend on a dating app. We dated for a short period of time, but decided we were better as friends and happily have stayed very good friends for years. We hang out several times a week haha. Also, we are opposite gender, so it is possible! But I will say, it’s only happened this once. I’ve made other attempts, but those friendship generally fizzle out after a couple of months.\n  "},
{"text": "\n    Yes surprisingly but only one in 5 years. a lot of how things progress depends on the person and their personality. she was chill.\n  "},
{"text": "\n    It helps if they're on a different continent.\n  "},
{"text": "\n    I definitely have made some great friends through dating apps. Being queer people factors into it though.\n  "},
{"text": "\n    I thought I had, and we were really good friends for about two years… and then he ghosted me. Still bothers me tbh, I just wish I knew if it was something I had done\n  "},
{"text": "\n    Yes, made 2 (M) such friends…was crystal clear on date 2-3 that I (F) cannot see it go further but enjoyed their company and if we could be friends.\n  "},
{"text": "\n    Those two have been in constant touch since then as just good friends sharing humor and daily mundane life takes. We even meet socially with their current partners or do other activities together and it’s loads of fun. Both of them so far have in no way made it feel weird.\n  "},
{"text": "\n    There were others too I would have liked to be friends with but the vibe became weird and them or I ceased being in touch.\n  "},
{"text": "\n    TL;DR: It’s possible. At present I have made 2 great friends…and throughly enjoying my expanded social life with them. Had conversations on remaining friends early on and maintained the theme.\n  "},
{"text": "\n    I met someone on pof about 3 years ago. Although we've not physically met we are good friends, and will talk about most stuff, even our dating lives. We talk most days as well.\n  "},
{"text": "\n    I have a very good friend that I made about 8 or 9 years ago. I've told him things that I've never told anyone else-and he confides in me, too.\n  "},
{"text": "\n    I'd be the first to admit that it's not a \"normal\" friendship. He doesn't know my friends or family, and doesn't live near me. Also, we can tell each other sexual details in a very matter-of-fact way, that I'd NEVER tell anyone (particularly not a boyfriend).\n  "},
{"text": "\n    I treasure the friendship, but I wouldn't want to have another-and I get more everyday emotional support from my more \"regular\" type friendships. I wouldn't, for example, moan to him about getting a parking ticket, or if Tesco had substituted black grapes for green. He'd probably ask me \"what the hell I was wasting his time with?\" Similarly, I would find it grossly inappropriate if he told me all about his difficulty in finding a birthday present for his niece-or if his kitchen sink is blocked.\n  "},
{"text": "\n    I guess it's a private intimacy that's only about either sexual or very big, emotional issues that are totally secret. If either of us were in real trouble, though, we would help the other.\n  "},
{"text": "\n    Sure have. two of my best friends I met years ago on lava life (yes it was big) and I’m still great friends with them today. Yes I did sleep with them (one it was actually just sleeping). I would t change a thing about how I met them.\n  "},
{"text": "\n    I did once!!! This is not a common occurrence. But I met a guy on a website (before apps!) probably 14 years ago? We went on 3 dates and decided there wasn’t a connection but stayed in touch over the years, we would come to each others parties/bbq’s and text lots, gave each other dating advice /opposite sex advice for years and years. He’s now having a baby with his partner, and still there for me reassuring me that I’ll find someone too. Its really wholesome and I have so much appreciation for our friendship.\n  "},
{"text": "\n    No. I've tried, but in the end I'm just not on apps to make friends, I'm happy with the ones I already have.\n  "},
{"text": "\n    Hell yeah! I've made several\n  "},
{"text": "\n    I thought I had made a great friend after we tried dating.  There were compatibility issues and to be honest I truly believe we were both platonic.  She however had severe hypochondriac issues and went dark of me when I refused to share my STD test results.  They were clean, but the fact that she asked in the first place was absolutely ridiculous to me as we had only made out.  She didn’t care about my health she was trying to see if I infected her in some way, so I guess in the end she never really saw me as a friend.\n  "},
{"text": "\n    I have 2 very good friends I met OLD. One of them ended up being my best friend now.  We went on one date, but both of us immediately knew it wouldn't go past friendship. We slept together once on a drunken night, but that's the only time it ever happened. Been besties now going on 5 years. It helps that he came out as gay a couple of years ago.\n  "},
{"text": "\n    My other friend I met OLD, we were in a relationship for several months then it fell apart. I moved states. But we are still good friends.\n  "},
{"text": "\n    There were several others I was friends with for awhile, but they all petered out for one reason or another.\n  "},
{"text": "\n    Apps give out what you put into them in my opinion. Idk if the pandemic just changed my dating behavior or if it was being out of the dating pool for years and the resulting damage from accidentally choosing a psycho... but I have made a few friends off of Tinder. Mar 2020, I matched and since it was early pandemic, we just chatted and gamed together on our ps4s. We discovered neither of us wanted the other after about 3-4 months, and have remained friends. He's met my parents and dog, I've met his dad. We're honest because we don't have any agenda of trying to sleep with the other person.\n  "},
{"text": "\n    I never really used dating apps until after my divorce.  I ended up chatting with a few people and most fizzled out pretty quickly. A couple are just on my facebook even thought we might not have ever met IRL.\n  "},
{"text": "\n    One friend tho I got pretty close to we ended up in bed on the first date.  She recognized me because I was regularly going to karaoke at our favorite bar, and brought me flowers, and then some stuff when I had a bad cold and it was feeling really too intense but I rolled with it.\n  "},
{"text": "\n    But it became clear to both of us that alcohol was behind the sexual desire on my end since we'd only hook up if I had been drinking.\n  "},
{"text": "\n    I liked her and really enjoyed her company but the disparity in income became a source of resent meant my last relationship, and this woman does her best but struggles to keep up with bills.  I can deal with that in a friend but not a romantic partner.\n  "},
{"text": "\n    She has a great personality but after so many of my own past failures, a lack of phsyical attraction while sober, and her financial struggles kept it from moving forward.  So we decided to just be friends.  She admitted after 3 years of us being friends now that she'd still date me, and I will sometimes cuddle or even share a bed without sex. We've made out a few times since. But mostly we're just close friends now, which I really appreciate.  Even though we both admit to each other we're kinda starved so we help each other out with a taste of intimacy now and then.\n  "},
{"text": "\n    It's just not there for me, and I wish it was :/\n  "}
]