[
link: https://www.reddit.com/r/Tinder/comments/15vbms8/whats_the_deal_with_people_only_looking_for/
subject: What's the deal with people "only looking for friends"
{"text": "\n    Because when ur older it’s harder to make friends but bumble has a feature for that not sure if tinder does\n  "},
{"text": "\n    The Tinder version I'm using has several options to choose from in the category \"Looking for\" and one of them is \"New friends\".\n  "},
{"text": "\n    If it's hard to meet people nowadays for trying to meet a potential partner, then it's also going to be hard when trying to meet new friends. They're just trying to use the app a different way, who knows they might meet like minded individuals.\n  "},
{"text": "\n    I don’t know but every male “friend” I’ve ever made on a dating app tried to sleep with me…\n  "},
{"text": "\n    if I could guess maybe they just don't want hookups, but want to find a connection that might actually lead to a relationship later down the line, but don't want to lead anyone on.\n  "},
{"text": "\n    idk, people are weird. if I see looking for friends in their bio I just swipe left and keep moving\n  "},
{"text": "\n    When I spent an extended period in a foreign country recently, this helped me meet some great people. Wasn’t looking for love because my time was temporary, but if there was sexual chemistry I wasn’t going to deny it.\n  "},
{"text": "\n    I moved to a new city and genuinely used all apps for friends only. I made it abundantly clear when I initially matched that I was only looking for friends to which a good deal of people unmatched, but in the end I made a handful of good friends.\n  "},
{"text": "\n    I moved to Chicago post Covid and didn’t know a soul, I needed all the help I could get.\n  "},
{"text": "\n    I'm sure that they do get friends via tinder. I wouldn't mind matching with someone to be friends with if I was getting 20+ matches a month (I sadly get none)\n  "},
{"text": "\n    Some men & women prefer establishing a solid friendship before dating. Don't let it confuse you, they're on a dating app for a reason.\n  "},
{"text": "\n    I met all my drug dealers on tinder. It’s multi-purpose\n  "},
{"text": "\n    I don’t trust them so I just avoid them completely.\n  "},
{"text": "\n    It’s kinda funny that I have made one friend through the apps though, but it did start with a date and nothing like this.\n  "},
{"text": "\n    Legit I assume they can’t be dumb enough to literally only be looking for friends on OLD apps and assume it’s their way of saying they’re only looking for casual flings.\n  "},
{"text": "\n    It’s a red flag though for sure.\n  "},
{"text": "\n    It's a way to set expectations from the start. They're not really looking for friends in most cases.\n  "},
{"text": "\n    She says she's looking for friends so you don't expect more than that, then get upset when it's not more than that.\n  "}
]