[
link: https://www.reddit.com/r/RandomThoughts/comments/14ovqfl/there_should_be_an_app_like_tinder_but_for/?rdt=55429
subject: There should be an app like Tinder but for finding friendships
{"text": "\n    If this submission above is not a random thought, please report it.\n  "},
{"text": "\n    "},
{"text": "\n    Bumble BFF does this\n  "},
{"text": "\n    As a dude, it seemed like all gay dudes that just weren’t ready to admit they were gay.\n  "},
{"text": "\n    There really should be an app where you send strangers quality memes, and they can comment and send memes back.\n  "},
{"text": "\n    So you swipe left/right on memes instead of photos, and it matches you with people who have the same taste in memes and live within beer distance?!\n  "},
{"text": "\n    Meet up app. Social events and groups based on your interests.\n  "},
{"text": "\n    This is great in major cities\n  "},
{"text": "\n    Anywhere else it’s probably useless unless you happen to be in one of the relatively few smaller towns and cities which have an active group - but the vast majority don’t\n  "},
{"text": "\n    Should be called frinder\n  "},
{"text": "\n    You're sure right.  34 years old, and right now I'm living in a recovery facility and making friends for the first time in over 10 years through our shared struggle with alcoholism.  Lol\n  "},
{"text": "\n    Lol. Wait til you hit 40.\n  "},
{"text": "\n    I would love that, it would be so fun to go on friend dates. I'm currently not looking for anything romantic, but I miss going on dates.\n  "},
{"text": "\n    Bumble bff my guy\n  "},
{"text": "\n    Thanks for the business idea I will now learn software for 4 years until im 18 and make 🏦\n  "},
{"text": "\n    Gl. Maybe you'll make some people's lives less miserable as an extra.\n  "},
{"text": "\n    Ascend past the need of human connection or sentimental attachments. Simple. /s\n  "},
{"text": "\n    Start volunteering. Habitat for Humanity, boys and girls club, environmental cleanup. All are great ways to meet people.\n  "},
{"text": "\n    That's only if you want to be friends with people who volunteer\n  "},
{"text": "\n    This is why golf was invented\n  "},
{"text": "\n    Anyone seems like a decent conversation partner while drunk and doing the most boring thing possible\n  "},
{"text": "\n    Call it \"Kinder\".\n  "},
{"text": "\n    \"Kinder\" means \"Children\" in German. 💀\n  "},
{"text": "\n    Theoretically we have it in the UK, but in my experience no one will connect with you.\n  "},
{"text": "\n    very popular in US too\n  "},
{"text": "\n    There is bumble BFF I used it to meet female friends\n  "},
{"text": "\n    I’ve used Bumble BFF with some success. I’ve matched with dozens of people but only ever meet up with one person. That person became one of my closest and dearest friends though! So low success rate but when it gets a hit it seems to be a home run.\n  "},
{"text": "\n    Moved to a new state 4 years ago, in my 40s, the struggle is real. I'm trying different FB groups (all some variation of \"women getting together\" in local cities). I think I'm realizing I may not make any "},
{"text": "\n    Try Meetup.com. The groups are really good in some cities/towns\n  "},
{"text": "\n    Sometimes i regret not keeping in touch with friends then i meet old ones or make new ones and end up in the same place of making excuses to not hang out.\n  "},
{"text": "\n    That would be Bumble BFF\n  "},
{"text": "\n    im so glad I saw this post! As a female (and now mom) I’ve used Peanut was great but it kinda became a crappy app. But I did meet a few people. But I was literally thinking today how I wish there was just a more chill app for just meeting people to make friends. It’s probably much harder for guys, too. Glad to see people had some good suggestions!\n  "},
{"text": "\n    Reddit is here for you\n  "},
{"text": "\n    Agreed, where you from mate 😂😂\n  "},
{"text": "\n    Bumble & FaceBook Dating both have friends as an option.\n  "},
{"text": "\n    In facebook when you put \"friends\" option guys just think you are playing hard to get🙄\n  "},
{"text": "\n    Anybody in Galway, Ireland?\n  "},
{"text": "\n    Bumble BFF is such an app but as a woman Beware there are tons of lesbians idk why, men who want female friends lmao, and mentally ill women. So choose carefully.\n  "},
{"text": "\n    Wait, is it bad to be a man looking for female friends?\n  "},
{"text": "\n    ive seen alot of apps that have a \"freind\" option thing and i find that incredibly annoying,why are you using a DATING app to find freinds? but saddly i dont know any,unless barq counts as one but thats for furries\n  "},
{"text": "\n    Make it.\n  "},
{"text": "\n    Agreed. Really hard to make friends when you don't drive and rarely have extra money. Can't even go have coffee with friends anymore since any money I get ends up going to bills because my grandma doesn't know gow to turn off lights\n  "},
{"text": "\n    The friendship version of Tinder would only help with finding garbage friendships, just like Tinder is strictly for finding garbage relationships. Be honest: is there really a market for that?\n  "},
{"text": "\n    I found 2 of my really close friends on bumble bff\n  "},
{"text": "\n    That would be interesting indeed!\n  "},
{"text": "\n    Meetup.com was a place where people just looking to talk about stuff could meet...up. I hope it still is that\n  "},
{"text": "\n    Depends on where you live. In a large city I'm sure it is useful. I'm in a medium sized Midwestern city, where it is mostly people looking for their next MLM victims\n  "},
{"text": "\n    Agreeing with others who say Bumble BFF! I had never used an app before and was worried about it being awkward, but instead I met an awesome gal pal who organized a drawing club and we meet up now. Worth the shot, and there’s really nothing to lose.\n  "},
{"text": "\n    Op.. do it create the app call it Fri ender!!\n  "},
{"text": "\n    Hahaha, well I think I need to dive into programming now!!\n  "},
{"text": "\n    How in the world you gonna, discern between a friend and a snake by swipping left or right. Finding friends takes personal contact, talking, getting to know somebody, time, ect..    Most of my friends, are lifelong friends.\n  "},
{"text": "\n    I have talked about this so many times.\n  "},
{"text": "\n    Yeah man when you're out of school out of college and start working say you work at a place they only has four people.... Like how the hell do you meet people\n  "},
{"text": "\n    I met a few good eggs on the Bumble BFF app.\n  "},
{"text": "\n    Because we lack a third place- which is due to car dependency\n  "},
{"text": "\n    How do adults make friends? It's hard, without it sounding creepy.\n  "},
{"text": "\n    Just a quick notice. Bumble bff won't work for everyone. but it is a good Try for anyone Looking to at least gain Some friends, if you're lucky.\n  "},
{"text": "\n    I mean it's called video games/discord\n  "},
{"text": "\n    True! I used to have game buddies back in HS. Had to stop for a while tho, that shit is addictive 😂\n  "},
{"text": "\n    Yeah, make an app to find people who make you smile. I’d call it grin-der.\n  "},
{"text": "\n    Bro more like finding real friends mine are all so plastic welp fake i guess i really need it any friends to talk to? Text me ;-;\n  "},
{"text": "\n    There is on Bumble I believe.  When it asks you what do u prefer,  you choose friendship.\n  "},
{"text": "\n    Seeing how you'd figure out Bumble BFF, I'll also add Meetups and select the interests you have (hiking, music, dodgeball) and check out the events and meet people there. Good luck!\n  "},
{"text": "\n    I second bumble bff but as someone else mentioned it is predominantly women and me personally (as a woman) am not going to swipe right on a man when using the friend feature.\n  "},
{"text": "\n    The Geneva app is really popping off in my city right now, I think it’s an app to join group chats based around different interests?\n  "},
{"text": "\n    Also not sure if you’re in the music festival or raving scene, but the app Radiate has a feature to swipe on people, lot of ppl on the app chatting and meeting up for various shows, that’s how my bff met her current bf!\n  "},
{"text": "\n    Bumble has a BFF mode, for finding friends. It usually works for me and on the off chance I match with someone interested in a relationship, I establish right away I only want to be friends\n  "},
{"text": "\n    As others mentioned there are some like bumble BFF. Beware though, it's a small \"market\" because generally people don't really search for these things so there's a high probabilty of people on there who specifically search for it. For example gay men/women that get a kick out of converting straight people.\n  "},
{"text": "\n    Only friends\n  "},
{"text": "\n    Meetup for local and in-person, Boo for online ( only if you restrict it to female only all the guys are not there for friendship).\n  "},
{"text": "\n    In my experience/what I hear from others, the folks on BFF were dry AF.\n  "},
{"text": "\n    Goodluck!\n  "},
{"text": "\n    Bumble BFF worked for me :) I met a couple people & we are still friends 2 and 4 years later. I’m going to one of their weddings this summer actually. :)\n  "},
{"text": "\n    WOW! I never thought of this, but this is a brilliant idea!! It is incredibly difficult to make new friends as an adult that is very busy. But everyone needs BFF energy!\n  "},
{"text": "\n    I’m sincerely jealous of those people who are still close to childhood friends. I don’t think I’ll ever make friends like that again.\n  "},
{"text": "\n    let's be friends OP.\n  "},
{"text": "\n    🥹\n  "},
{"text": "\n    There should also be one that's just for fighting. Like if you just want to fight a guy....or girl? You get a match, meet up somewhere ,and throw hands.\n  "},
{"text": "\n    Sounds like an American with a lack of a 3rd place. I'm right there with you.\n  "},
{"text": "\n    There should be one for finding D&D players\n  "},
{"text": "\n    I know some people already mentioned Bumble BFF, but as someone who has used it and found some local friends after moving cities, I highly recommend it. Yes, it does require work, as it’s basically a dating app without the romantic aspect, but it works!\n  "},
{"text": "\n    My country has government funded friendship sites for people with mental or social difficulties. My best friend committed suicide almost 2 months ago and this site really helped me. I don't care that some Americans call my country a socialist country "},
{"text": "\n    As an American, I wish we were more of a socialist country.\n  "},
{"text": "\n    Actually that sounds like an amazing invention. Where are you from if you don't mind me asking?\n  "},
{"text": "\n    Patook.  Found a true friend on there, and so far I’ve managed to avoid any freaks.\n  "},
{"text": "\n    A good idea but what defines a friendship?\n  "},
{"text": "\n    I thought I have friends but life showed me - now with 53 - that I have never had at least only one (except from my current wife) ...\n  "},
{"text": "\n    So what is important for you? And when would you call someone a friend? What has to be that a feeling of friendshipness (?) could come up?\n  "},
{"text": "\n    Isn't friendship the feeling of intimacy with each other?\n  "},
{"text": "\n    Absolutely! I miss having lady talks. I had a friend at the uni with whom I was really close. Now that we are living in different cities, she has another friend. I'm stuck in a small town with nobody familiar here. I can only chat online, but I miss meeting in real life, having nice conversations, just the ladies company. My bf is also my best friend, but it's different to talk to a man, you know? So yeah, I think I just would like to have someone I could lean on, and so I could give this person the same feeling!\n  "},
{"text": "\n    2033 - A new app is developed called Friender that is designed to help our now completely social media obsessed yet perpetually lonely society develop friendships. It becomes a smash hit, soon far eclipsing any dedicated dating apps due to the sheer amount of people using it.\n  "},
{"text": "\n    Years later a lonely redditor creates a post suggesting that we should make an app like Friender but dedicated to finding people looking for MORE than just friendships.\n  "},
{"text": "\n    The cycle continues.\n  "},
{"text": "\n    Beautiful pasta 😆\n  "},
{"text": "\n    Well, dang, I'm in need of some new friends, too! (27 M US) If someone needs someone to talk to, you can DM me. Hope everyone's doing well, or gets there, soon. <3\n  "},
{"text": "\n    If you're interested, and you're not looking for someone local, there's a subreddit where you can get/find penpals.\n  "},
{"text": "\n    There’s was one app the legit advertised itself as just that on the App Store (don’t remember the name) when I was in highschool and was for people under 18. Of course most people still used it for nudes and hookups and stuff like they use tinder. But I met one of my now best friends on there, at the time he would say he was straight, but since I was out publicly, he felt comfortable enough after a few months to tell me he liked guys. I encouraged him to come out to his family when he was ready, and was there every step of the way. 6 years later he has an apartment in the city with his boyfriend, and a good relationship with his family. We don’t talk as often as we used to, but he will always be one of my best friends. After all, I did take care of him when he got syphilis, so there’s no going back after that.\n  "},
{"text": "\n    Also, damn he was good at Super Smash Bros\n  "},
{"text": "\n    That's a lot going on! Glad you could experience a friendship like that ❤️\n  "},
{"text": "\n    My 4 closest friends and I met on bumble BFF. We’ve been each other’s support network for 5 years now and speak every day. I’ve never had friendship this wonderful from anyone I met through “normal” ways - give it a try!\n  "},
{"text": "\n    Start it up!! Love this idea! Or start a local one in your area!! Good luck!\n  "},
{"text": "\n    That would be so nice, let's start one!\n  "},
{"text": "\n    Damn it's so heartwarming to read the EDITs\n  "},
{"text": "\n    🥹\n  "},
{"text": "\n    I agree. You'll occasionally find women on dating apps saying she's just looking for male friends but really that's just a chick looking for a simp or a better option than what she has.\n  "},
{"text": "\n    Who hurt you?\n  "},
{"text": "\n    There's plenty of them... And they work well\n  "},
{"text": "\n    Yes, brilliant idea for an app\n  "},
{"text": "\n    Yeah there should be .. would be much more useful  than Tinder\n  "},
{"text": "\n    Bumble\n  "},
{"text": "\n    It just gets harder after your 30s too. By then you're a bit strange.\n  "},
{"text": "\n    There already such app. It's called Bumble BFF.\n  "},
{"text": "\n    OP means like friends, go to the pub, goes to ball games, goes camping, shares hobbies, not a single girlfriend\n  "},
{"text": "\n    So, tinder?\n  "},
{"text": "\n    I found my bestfriend on Tinder. At first we were supposed to bone but we never did that and became super close. Now we can't spend a day without calling each other\n  "},
{"text": "\n    Its called Reddit\n  "},
{"text": "\n    There is but it's crap. I don't remember what it's called either. There hopefully are more now.\n  "},
{"text": "\n    I used Patook\n  "},
{"text": "\n    Bumble\n  "},
{"text": "\n    OK Cupid\n  "},
{"text": "\n    I'll be your mate, where do you go to uni?\n  "},
{"text": "\n    Awww 🥹 that's the thing, I'm out of uni already and making friends in adulthood is hella hard! I'm open for a chat anytime though 🤙\n  "},
{"text": "\n    yeah it's called Meetup\n  "},
{"text": "\n    Facebook dating has a friends only matching thing.\n  "},
{"text": "\n    Well based on what all the women on tinder say to me, it is just for friends.\n  "},
{"text": "\n    Take up a group activity. Hiking groups, biking groups, martial arts, etc.\n  "},
{"text": "\n    I joined a small yoga studio to find friends about 10 months ago and it totally worked!\n  "},
{"text": "\n    Meetup.com, great for finding social hobby groups, best way to make friends imo\n  "},
{"text": "\n    Bumble\n  "},
{"text": "\n    I think either bumble or hinge has a bff app.\n  "},
{"text": "\n    And in your 40's!!\n  "},
{"text": "\n    Wasn't that what Facebook was supposed to be for?\n  "},
{"text": "\n    Facebook was originally setup for peoples  existing friend networks and finding lost friends to keep in touch with. Not make new friends with strangers...\n  "},
{"text": "\n    Friendship apps would be like shooting fish in a barrel for con artists. Lonely people are the easiest to manipulate\n  "},
{"text": "\n    Bumble has a friendship and also a networking option\n  "},
{"text": "\n    I love that 💖😍\n  "},
{"text": "\n    I had this friend who had just moved to the city and she invited me to a party and I was like wow she knows a lot of people she's only been here like two weeks turns out she went on a dating app and invited all these dudes to a party not even to date just to have a party and meet people. Idk if they're down to show up why not\n  "},
{"text": "\n    There is an app called Meetup, however it's not geared towards meeting one-on-one, it's more group-oriented. You can make friends through it though.\n  "},
{"text": "\n    Actually it's how I met most of my current friends. If I only had work and not much else, I would have met hardly any of these people.\n  "},
{"text": "\n    There is bumble BFF.  That helps find friends\n  "},
{"text": "\n    There is. Bumble has a friend setting. Just like the normal swipe left or right type of thing, but with friends.\n  "},
{"text": "\n    Friender?\n  "},
{"text": "\n    You mean bumble?\n  "},
{"text": "\n    Everyone wants to fuck, they don't want to be friends.\n  "},
{"text": "\n    Don't make me lose hope :(\n  "},
{"text": "\n    Those friend apps are bullshit. Well on the women’s side it’s all “boss babes” trying to sell MLM awful!\n  "},
{"text": "\n    My wife said that's what she uses Tinder for already\n  "},
{"text": "\n    I know these things are expensive, but crossfit gyms in your neighborhood seem to be friendly, if not culty.  If you have the means and their time slots work, join one.\n  "},
{"text": "\n    Or a running club.  I know these are all fitness oriented, but its a good way to kill two birds with one stone.  Little more personable than just a gym or yoga class etc where people tend to keep to themselves.\n  "},
{"text": "\n    If you’re in a small town, i dont know how to help you.  People imo want to stay friend free in those places.\n  "},
{"text": "\n    Facebook has a friends section.\n  "},
{"text": "\n    a site that does this suprisingly well is Plenty of Fish.\n  "},
{"text": "\n    people state exactly what they are looking for in their profile and plenty of people on there are just looking for friends. Its really not as much of a hook up app like tinder.\n  "},
{"text": "\n    Wait until your 50s and you and your friends have all drifted apart. That’s no party\n  "},
{"text": "\n    I'm right there with you, friend!\n  "},
{"text": "\n    Just wait until you get into your thirties, it’s brutal out here\n  "},
{"text": "\n    Friendr. Someone make it.\n  "},
{"text": "\n    Friendster\n  "},
{"text": "\n    Start one .\n  "},
{"text": "\n    Sell it for $1M.\n  "},
{"text": "\n    Get a date.\n  "},
{"text": "\n    I've tried using the friend feature on some apps and just get gay men trying to fuck me.\n  "},
{"text": "\n    Every girl I've ever matched with has only been looking for friends..... am I doing it wrong?\n  "},
{"text": "\n    Meetup.com\n  "},
{"text": "\n    That would be nice.\n  "},
{"text": "\n    Yubo is an option,\n  "},
{"text": "\n    Man just go join a club or get a hobby. Not everything needs digitized.\n  "},
{"text": "\n    Bumble BFF has been taken over by the alphabet ppl… a.. ah… friend told me…\n  "},
{"text": "\n    "},
{"text": "\n    Yeah it's like that in your late 20s but if it makes you feel any better, in your 30s it gets worse.\n  "},
{"text": "\n    The concept of tinder was basically finding a partner or date based on looks. Do you really want to find friends based on looks?\n  "},
{"text": "\n    Ofc not! But you also have a bio and interests at your disposal. But about the photos, as I've already swiped a few accounts on Bumble, I really appreciate goofy photos, especially with animals cause that helps me with this famous \"vibe check\" 😂 so no, photos not as a primary reason but as a nice addition!\n  "},
{"text": "\n    Bumble\n  "},
{"text": "\n    FRIENDER\n  "},
{"text": "\n    There is one. Bumble bff\n  "},
{"text": "\n    Download the Brorape app. You can find bros to play Xbox with.\n  "},
{"text": "\n    This. Name. Is. Horrifying.\n  "},
{"text": "\n    is tinder not for friends? i know its a dating app but my ex told me she used it to find friends. ive never used the app myself.\n  "},
{"text": "\n    They keep trying to make one and it keeps getting horny\n  "},
{"text": "\n    I totally agree. Even apps with a friend option like bumble are hard to meet people on.\n  "},
{"text": "\n    Personally Facebook meetup groups helped me a lot. I’m in a girls only horse group so we can feel safe when riding.\n  "},
{"text": "\n    Most friendships from it would end with one of the people sending a nude because that's how those apps are used\n  "},
{"text": "\n    There’s no Friender app?\n  "},
{"text": "\n    Call it Friender\n  "},
{"text": "\n    Tinder can be anything you want it to be.\n  "},
{"text": "\n    "},
{"text": "\n    I'm 46 and could use this too.\n  "},
{"text": "\n    There's been dozens but they always turn into hookup apps... Every time.\n  "},
{"text": "\n    Tinder… the real hook up is the friends we make along the way…\n  "},
{"text": "\n    Call it \"Friender\"\n  "},
{"text": "\n    Grindr is close /s\n  "},
{"text": "\n    Kik has a \"find friends\" feature. It usually goes like this.\n  "},
{"text": "\n    M or f\n  "},
{"text": "\n    M\n  "},
{"text": "\n    Xyz has disconnected\n  "},
{"text": "\n    This is how a lot of these apps tend to go\n  "},
{"text": "\n    Dude, go volunteer for any organization you like. Other volunteers would likely be like-minded.\n  "},
{"text": "\n    I feel the same way\n  "},
{"text": "\n    Bumble bff for guys is funny, it’s just gay men casting an even wider net.\n  "},
{"text": "\n    Yeah it's called hobbies\n  "},
{"text": "\n    I don't want to see my friend's dick picks 🤷\n  "},
{"text": "\n    I recommend 'Boo'. It's more neurodivergent friendly too. I used it when I went to San Francisco and use it where I live and have made many really solid friends!\n  "},
{"text": "\n    Bumble has a friendship option but it still feels weird and sexual.\n  "},
{"text": "\n    idk if someone said this BUT there is an app called Hey Vina (I think it is exclusively for women though? i’m not 100% sure!)\n  "},
{"text": "\n    Yeah! I was hyped when I found it but seems to be working only on iPhone :(\n  "},
{"text": "\n    There are quite a few options like that. And if you have a specific interest, there are options like meetup.\n  "},
{"text": "\n    Uni was supposed to do that, and I did make some friends that I like but then after the first semester the you-know-what happened and messed up my chances\n  "},
{"text": "\n    You got it wrong....\n  "},
{"text": "\n    Dating apps are for scammers, pros and nutters,  tinder is just full of these.\n  "},
{"text": "\n    Meetup.com type apps are for dating!\n  "},
{"text": "\n    Lol.\n  "},
{"text": "\n    Bumble has abff option\n  "},
{"text": "\n    Facebook dating has a friends option now too.\n  "},
{"text": "\n    Doesn't Tinder literally have an option for finding new friends? Idk how much choosing that affects the outcome though.\n  "},
{"text": "\n    Bumble has BFFs. Used it a bit while travelling, it was OK.\n  "},
{"text": "\n    Was gonna say Bumble BFF but looks like ppl already commented that.  I’ve found quite a few friends on bumble BFF\n  "},
{"text": "\n    Awhile ago I tried BumbleBFF, but ended up getting hit on by gay dudes constantly. Even after saying I am straight, just looking for friendship, they continued to still hit on me.\n  "},
{"text": "\n    Could try that? Hopefully it has changed since then.\n  "},
{"text": "\n    Wait till ur 30-40\n  "},
{"text": "\n    I had used an app to find male friends and it so happened that whoever I matched with turned out to be gay. Exchange of pleasantries and then they ask - what are you looking for 🤣 After that I stopped using apps to find friends.\n  "},
{"text": "\n    Recently tried Meetup, and this woman who organises parties started messaging me on WhatsApp asking for pictures.\n  "},
{"text": "\n    Friendies 😂\n  "},
{"text": "\n    The best way to make friends as an adult is to go to events and classes.\n  "},
{"text": "\n    For me it’s ecstatic dance, events and classes at my local yoga studio and a monthly drum circle and bon fire.\n  "},
{"text": "\n    Whatever you’re interested in start going to events based around it. Church used to be what did this for everyone back when everyone was religious. Now we just have to find other things to gather around.\n  "},
{"text": "\n    I like that idea\n  "},
{"text": "\n    Isn't that also Tinder? Just meet up and friend zone them immediately.\n  "},
{"text": "\n    Can't wait for: Amish Friendship App version 3.2 to release.\n  "},
{"text": "\n    ...\n  "},
{"text": "\n    Why did the Amish girl get chastised? Too Mennonite.\n  "},
{"text": "\n    Yes. Yes times a million.\n  "},
{"text": "\n    You’re right.   And there should be the same for ppl who are looking to have kids assp.\n  "},
{"text": "\n    I use Patook, there's a whole process to go through when you make an account there, it's not super complicated, but it helps them confirm that the people making accounts are actually people and are not there looking for dates.\n  "},
{"text": "\n    Patook has a strict no flirting rule, and they enforce it very seriously. One time I sent someone a ❤️ because they shared a picture of their puppy, and I got a little warning message along the lines of \"excuse me, please remember no flirting! 🙂\"\n  "},
{"text": "\n    One time I came across a troll profile, that let's say... I wouldn't call it porn exactly, but they definitely weren't there to make friends. Reported it and within two days that profile was gone.\n  "},
{"text": "\n    I actually feel relatively safe there lol\n  "},
{"text": "\n    That sounds great! I can't find this app tho - is it available by another name now, maybe?\n  "},
{"text": "\n    Go join a group for something you’re interested in.\n  "},
{"text": "\n    Fuck friends?\n  "},
{"text": "\n    Not a bad idea.\n  "},
{"text": "\n    SEND ME THE LINK WHEN YOU SET IT UP!!!\n  "},
{"text": "\n    It would be nice but it wouldn’t be too long before the scammers and predators made it unsafe and useless.\n  "},
{"text": "\n    Meetup?\n  "},
{"text": "\n    There is an app — it’s called Bumble\n  "},
{"text": "\n    Looking for someone in the Reno area who wants to get together and play with Legos.\n  "},
{"text": "\n    I wish there was something like that that wasn’t full of people looking for hook ups pretending they want friendship. My last few attempts at making friends has gone weird.\n  "},
{"text": "\n    you can litterally use tinder as a friend finding app. you'll get people wanting to hook up here and there but as long as your clear in your bio you can find some peeps.\n  "},
{"text": "\n    Figure out how to properly communicate and interestingly converse with other humans in-person. IN-PERSON. No excuses. This is how it’s done… I promise.\n  "},
{"text": "\n    I see where you're coming from and again, I agree that face to face interactions are the absolute best. Welp, maybe I'll be lucky one day to try it again :')\n  "},
{"text": "\n    Grindr? Lots of potential friends on there for you…\n  "},
{"text": "\n    Trying to find friends for the sake of finding friends is probably a recipe for disaster.\n  "},
{"text": "\n    Sure. Maybe I put my post a bit vaguely cause I just wanted to spit it out yesterday :') bht ofc I mean to find a friend with whom I can share my thoughts, spend time, and stuff.\n  "},
{"text": "\n    Yeah but men will still use it to harass girls pretending to be interested in friendship.. i was once on a language exchange app that had strict rules against trying to use it as a dating app.. and i still got creepy messages daily.. calling it a friendship app isn’t gonna make things better.\n  "},
{"text": "\n    Almost 40 here, and I can say I've made zero friends in the last 20 years. But it's hard to make plans when you can't decide if you'll be in the mood to even leave your house til the morning of. So I don't make plans 95% of the time. And now I have a 1 year old, so my plans are, her.\n  "},
{"text": "\n    What is wrong with Facebook?\n  "},
{"text": "\n    There are some very nice apps out there like Bumble and MeetUp\n  "},
{"text": "\n    Bumble Bff\n  "},
{"text": "\n    Your 20s! Hahahaha\n  "},
{"text": "\n    Cries in 40s.\n  "},
{"text": "\n    😂😂😂 hang in there!!\n  "},
{"text": "\n    There is one for ladies, Hey Vina\n  "},
{"text": "\n    I was hopeful for that one when I found it but it's only for iPhone :((\n  "},
{"text": "\n    I know everyone has their issues with TikTok but if it wasn’t for TikTok I have actually meet so many amazing people who also share my interests as well we actually ended up becoming this giant found family and I’m grateful for getting to meet them it does happen it might take some time but does it happen\n  "},
{"text": "\n    Isn’t that what bumble is for?\n  "},
{"text": "\n    What about online chat buddies\n  "},
{"text": "\n    I mean that's basically all tinder is now, excluding bots and drug dealers\n  "},
{"text": "\n    Facebook has it in their dating function now. I was surprised why there are boys now in my feed.\n  "},
{"text": "\n    it may hurt my feelings more if someone told me they didn’t want to be my friend as opposed to a potential partner\n  "},
{"text": "\n    Damn... This hits right in the spot. Like now probably someone's swiping me left on Bumble. Lol that hurts!\n  "},
{"text": "\n    Don't bother with bumble BFF, I tried it a while back because I work overnight and wanted to make some friends after moving across the country and it was just a bunch of gay dudes trying to fuck.\n  "},
{"text": "\n    A lot of us younger American grew up not having a lot of unstructured free time. I didn’t just run around outside for hours when I was a kid. I had lots of structured activities I did that I got signed up for and that’s how I made my friends. It’s a little daunting at first because all of a sudden you go from having your main places of socializing being things you have to do or things your parents signed you up for to having literally no structure.\n  "},
{"text": "\n    Find a new hobby that’s a group activity or has regular group classes! Join an adult sport league or join a volunteering/community organization that meets regularly! I grew up playing and singing classical music so I’ve joined in with some community choirs and orchestras and now also volunteer some! Consistency is key! Whatever you chose go frequently and around the same time! 3rd of 4th time you see someone give them a “hey you were here last week right?!” Boom got yourself a potential new friend!\n  "},
{"text": "\n    Bumble has a friend version. My friends wife uses it\n  "},
{"text": "\n    Sounds like your trying to get robbed to me. No joking. People are too fake there would need to be a bigger screening process. Hell maybe a office with a lie detected then and only then.\n  "},
{"text": "\n    This is a damn problem in the modern world. I just want friends. Like genuine people I could talk to about anything and meet up sometimes. Is that what we're doomed to now? Faking everywhere? :/\n  "},
{"text": "\n    bumble bff\n  "},
{"text": "\n    Friends Without Benefits app.  Hmmm.  FWOB\n  "},
{"text": "\n    Damn made me really think about things. I'm that person people are always trying to make plans with but I'm such a family man I can't find a whole lot of time so I'm constantly turning people down. It sucks but then again I've lived this rockstar lifestyle up until I started my career and most people don't know my life. So everything seems to be a bore unless I make it \"interesting\" and then I will either scare you away or you become a stalker almost so I just tell people \"nah I'm good\". Hang with me you'll never be the same again. So I try not to make new friends, can't keep up with the ones I have now. It's all about balance\n  "},
{"text": "\n    Friends are overrated anyway\n  "},
{"text": "\n    Agreed\n  "},
{"text": "\n    Just get a dog, they’re like a person but better\n  "},
{"text": "\n    I have a cat and I love her with all my heart, but when I try to tell her what's wrong she wants to jump at my face :/ she's fiery lol\n  "},
{"text": "\n    Most on tinder tell me they just wanna be friends, so it kind of already does the job\n  "},
{"text": "\n    True , late 20s is kinda time when we find it difficult to find genuine friends\n  "},
{"text": "\n    I could probably make that app with a few Redditors.\n  "},
{"text": "\n    Hey Vina is good for women looking for friends\n  "},
{"text": "\n    It's only for iPhones tho, right? :(\n  "},
{"text": "\n    I joined a few Whatsapp groups for hobbies, weekend  activities and meetups and it's changed my view of social apps. Can't tell you how awesome it is, you just have to try it.\n  "},
{"text": "\n    Some apps have that option for \"friends only\". However, if you aren't attractive enough, you can't make friends either, it seems.\n  "},
{"text": "\n    Get a hobby. Find a local to you organised meet up of that hobby.\n  "},
{"text": "\n    Work part-time in the evening down the local pub.\n  "},
{"text": "\n    The older I get the more I love solitude. It’s weird. When I was young I sought many friends and acquaintances, but these days,  I find people shallow and annoying.\n  "},
{"text": "\n    The best and easiest way to make new friends is go and learn new things and join clubs, tennis, soccer, book clubs, photography, etc\n  "},
{"text": "\n    Bumble has this and also a work version\n  "},
{"text": "\n    I thought about this too and tried Bumble BFF when I moved to a new city but there wasn’t anyone on the app I saw myself being friends with. More of a me problem though I guess.\n  "},
{"text": "\n    Not if you actually go to places, sports events, hobbies, whatever, I make crapton of friends. Put them apps down.\n  "},
{"text": "\n    Shocked this hasn’t been invented\n  "},
{"text": "\n    No! Electronic devices already replace waiters (at least in McDonalds), support services, etcetera.\n  "},
{"text": "\n    Because of this, people tend to choose more the \"bubble\" they live in surrounding them with the people they choose.\n  "},
{"text": "\n    The cherry to this pie would be an app in which we are not forced to talk anymore to people we don't immediately have connection with!\n  "},
{"text": "\n    I think people should choose their friends, but should keep on working on connecting with everybody.\n  "},
{"text": "\n    Kijiji 😂\n  "},
{"text": "\n    Or for parents with young kids - should have couples profiles and play dates\n  "},
{"text": "\n    I found out there's an option like that on Bumble! You set up your profile for \"looking for friends\" and then you can specify it to \"kid playdates\" !:))\n  "},
{"text": "\n    I’m still making new friends and I want to help people who struggle with it. This is not a criticism but - before the internet, people made friends in the real world. We had get-togethers - I went out 6 nights a week and had bbqs + day trips during the day. Making friends requires time, effort and knowing how to talk to strangers to find similarities and differences. I rocked up to a pub gathering last Fri night and met 8 people - hung out - had a few dances (DJ was spinning) then connected on social media to catch up again. Making new friends doesn’t just happen - you have to make it happen. I booked a ‘Xmas in July’ roast lunch next weekend at a cool pub - then invited 5 people and organised a birthday cake for a girl whose birthday is in January. Why? COS IT’S FUN! I’m surprised more people don’t make the effort and learn how. It ain’t rocket surgery. Maybe I can do a Reddit AMA on it.\n  "},
{"text": "\n    OrangePillApp!\n  "},
{"text": "\n    Bumble (well-known dating app) has a friends zone too :)\n  "},
{"text": "\n    I tried chat roulette but it was mostly guys with their dicks out\n  "},
{"text": "\n    Omg I was using it back in the middle school with my friend. Dicks every other time. Only once we met some Romanian guys whom we played the guitar with! That was cool. I'd be afraid to try chat roulette now, tho 🤣\n  "},
{"text": "\n    27F Australia. Hi!!\n  "},
{"text": "\n    OMG my earliest DREAM is to go to Australia! Hi there!!!\n  "},
{"text": "\n    It's called facebook\n  "},
{"text": "\n    People still use tinder to find friends\n  "},
{"text": "\n    Bumble has a friend finder app\n  "},
{"text": "\n    You can use Tinder for finding a friend. Just indicate this in your bio. It’s possible. I know a girl who made friends such way and girls were agreed to meet with her only because of friendship purposes\n  "},
{"text": "\n    Imagine the sadness not only does no one want to date me, no one wants to be my friend either!\n  "},
{"text": "\n    You can even make a stranger your friend but people nowadays just can't talk with others.\n  "},
{"text": "\n    Bumble has an option to find a partner or find friends ☺️\n  "},
{"text": "\n    Tinder was that app actually. And any another app for finding friends will end up like tinder or worse. I guess it’s just natural.\n  "},
{"text": "\n    The Japanese use Tinder exactly for the purpose of finding friends. Not, for hookups\n  "},
{"text": "\n    Some of those sites have that option. I actually took a guy out from POF to tour DC and he was on the friend part of the site. We had fun but it wasn't a date it was just a hey I just moved to the area and would like to make friends. It was fun being a tour guide for the day. Unfortunately the last time I checked they got rid of the option.\n  "},
{"text": "\n    Every app is for finding friends if used for that but we users make it something else.\n  "},
{"text": "\n    I usa tinder as a friendship app. You\"ll need to match with girls that dig you romantically but never make a move on them. This is when I'm traveling of course.\n  "},
{"text": "\n    Step one. Get a hobby.\n  "},
{"text": "\n    Step two. Do said hobby.\n  "},
{"text": "\n    Step three. Talk to others and participate mutually in said hobby.\n  "},
{"text": "\n    Don’t need an app. As long as you have a below average face, you’re automatically get replies of “I’m just interested to be friends” from your matches. 🥹\n  "},
{"text": "\n    OMG, that's so bad and so good XD 🙈\n  "},
{"text": "\n    Tinder can be used for finding friendships. Just ask my ex girlfriend\n  "},
{"text": "\n    Luckily, my main interest is butt stuff so Tinder works okay for me.\n  "},
{"text": "\n    Facebook dating also has a friend feature, like Bumble.\n  "},
{"text": "\n    Friendr\n  "},
{"text": "\n    Damn, you're in Poland. I would've invited you around to play Mario Kart\n  "},
{"text": "\n    Australian again?! Man, that's a sign for me to finally move there!!\n  "},
{"text": "\n    Pretty sure that's how social media used to work. Now it's for making enemies.\n  "},
{"text": "\n    Meetup.com ?\n  "},
{"text": "\n    Wait till you are in mid 30s. It’s like an apocalypse of friends here.\n  "},
{"text": "\n    Join local groups on face book specific to your interests.\n  "},
{"text": "\n    I wish there is something for introverted gamers/anime watchers.\n  "},
{"text": "\n    Stop reading my mind seriously\n  "},
{"text": "\n    "},
{"text": "\n    Same struggles 😕\n  "},
{"text": "\n    Friendster\n  "},
{"text": "\n    Problem is people would use it to Hit on people, shit some people even treat FB as a dating app.\n  "},
{"text": "\n    I’m creating an app like that lol. Mostly for people to meet each other in groups of 3-5 offline.\n  "},
{"text": "\n    ARE YOU FOR REAL?? Man please, let me know when it's ready!! Or even for a demo version I'd be glad to test it!\n  "},
{"text": "\n    Bumble has a friend option\n  "},
{"text": "\n    Man, i'd settle for an app that would help people set up an online co-op video game night.\n  "},
{"text": "\n    Sign me in! That would be a smash!!\n  "},
{"text": "\n    just put \"looking for friends\" in ur bio lol.\n  "},
{"text": "\n    I thought fb was for making friends\n  "},
{"text": "\n    Red Hot Pie\n  "},
{"text": "\n    Hookup app? Are you for real man? 🥲\n  "},
{"text": "\n    I agree, but my local does me fine. Met loads of cool people there.\n  "},
{"text": "\n    Bumble has an option for this\n  "},
{"text": "\n    interpals\n  "},
{"text": "\n    Iv tried the apps like people suggest but it seems like bs. Like people are pretending to want to be friends but it's still all hookups and drugs. I just wanna make friends and maybe they will pose for some of my bad portrait photography lol.\n  "},
{"text": "\n    So yesterday I set up a Bumble account, today Boo. It seems pretty genuine (at least for now lol). What really irritates me are those payments if you want to see who liked your profile. I mean, cmon, does everything have to be monetised :/\n  "},
{"text": "\n    Tinder is just a hook up app. You only want fair weather friends?\n  "},
{"text": "\n    I used to think like that, but I have several friends who met descent partners there and are now planning to make their relationship more official, through civil union for exemple.\n  "},
{"text": "\n    There should also be a dating app like Tinder that doesn't ruthlessly monetarily exploit men's desire for connection.\n  "},
{"text": "\n    Bumble BFF\n  "},
{"text": "\n    If u need friends buy a motorcycle\n  "},
{"text": "\n    That's a new one! Can you elaborate? :D\n  "},
{"text": "\n    I just read u are a woman and if u can ride, go to a track day and ppl will literally be ne up to say hello\n  "},
{"text": "\n    Pretty sure tinder did it before for friend groups and met some real weirdos\n  "},
{"text": "\n    I mean discord..\n  "},
{"text": "\n    I agree it is hard and should be something but I feel people would ruin that to.  Gumtree used to have a friend finding section but that was ruined.    I’ll put there out.  If anyone wants to talk, go out for food, cinema, seaside just get in touch.   I offer but rarely anyone ever ask.  Because it’s weird.   People ask what’s the catch or what’s the game.\n  "},
{"text": "\n    It’s hard to be open and honest without seeming sus, this is why I believe there isn’t an app.\n  "},
{"text": "\n    Cain\n  "},
{"text": "\n    nevermet i recommend\n  "},
{"text": "\n    Friender\n  "},
{"text": "\n    Pull yourself up by the friendship bootstraps and go start knocking on doors\n  "},
{"text": "\n    There already is. It's called Venn, connects users with new friends, and social activities 🤩 It's a Norwegian app, by far the largest friend making app here. As far as I can see, it is starting to grow in the US and UK too. I'm happy with it so far😁\n  "},
{"text": "\n    "},
{"text": "\n    Somebody should create OnlyFriends.\n  "},
{"text": "\n    I second that\n  "},
{"text": "\n    There are. However Bumble BFF from my experience has become Grindr.\n  "},
{"text": "\n    They do, it's call go do stuff. Works for regular dating too, but the good part about finding friends is you don't have to wonder if they already have a friend\n  "},
{"text": "\n    Lmao any “dating” app is good for finding “just friends”….\n  "},
{"text": "\n    Yo I feel this. I only got really one person I hang with now, a few I still talk to but are in different areas and we don't meet up much anymore. I feel like so many feel this way but flat out asking random folks just seems like a weird approach🤣. Why? Lol\n  "},
{"text": "\n    «Venn» is one that is pretty popular in Norway, i see more people in other countries as well. We have a group there that is going for friday beers this week 🍻👍\n  "},
{"text": "\n    If you're in Norway or live close to Scandinavian countries, try "},
{"text": "\n    Purp\n  "},
{"text": "\n    Friender?\n  "},
{"text": "\n    Me and some friends had one of those night club smoking area licking our ears brain storming sessions years ago and come up with this, we were gonna call it ‘Tinker’\n  "},
{"text": "\n    Wait until your mid 30s\n  "},
{"text": "\n    Would like if they were more of those apps. Bumble BFF is great, but having options would be nice.\n  "},
{"text": "\n    Try We3. It’s strictly for finding friends and matches you in a group of 3 people to make it less awkward and more geared to forming friendships.\n  "},
{"text": "\n    I kinda love and hate this idea. Love, cause I see it can really help with awkwardness, hate cause I've been in a few 3-people friendships and it was always ending in disaster... But worth a try for sure!\n  "},
{"text": "\n    This was what people were told when social media was introduced to the public. It’s funny it has turned away from meeting new people and focuses on silly memes and “influencer” culture now.\n  "},
{"text": "\n    Just get a party mansion and put out some flyers shaped like a bicep (so the other dudes know you're tough/like to workout) to advertise. I would just make sure to explicitly state \"nothing sexual\".\n  "},
{"text": "\n    its called go outside and sit and talk to people instead of arguing whose right or wrong\n  "},
{"text": "\n    No.\n  "},
{"text": "\n    This is dystopian in the extreme “I swipe left unless friend has six inch cock and makes six figures.” No. No no no no\n  "},
{"text": "\n    What. Who even thinks like that\n  "},
{"text": "\n    If you ask my cheating ex, then that's exactly what those apps are for 🤡\n  "},
{"text": "\n    Hinge is that.\n  "},
{"text": "\n    My ex wife claimed to use tinder for that.\n  "},
{"text": "\n    I’m almost 40. I don’t meet friends anywhere. I kinda like keeping my circle small. I like the friends I have. But it would be cool to have girl friends. I have ZERO girl friends. But females as friends suck. Why is this? Why aren’t women friends with women? I’ve never had a good girl friend. They’re all fake and two faced.\n  "},
{"text": "\n    It's called leave your house.\n  "},
{"text": "\n    They are. But not so common between adults. I used Yubo for a while but lately more and more teens have started to use it and it's boring.\n  "},
{"text": "\n    There once was such a fun social media app named 'Quiz up' where people can test their knowledge on varieties of topics , sharing topic based quality memes / content and make friends!  I made a lot of friends those who are interested in as same topics as me and I loved bantering with them in commenting sections 🤧 They deleted that app for some reason in 2018 ( I guess) and I still miss that.\n  "},
{"text": "\n    Edit : that app was officially deleted 2020 . :(\n  "},
{"text": "\n    Omggg that sounds like so much fun! What a pity they deleted it\n  "},
{"text": "\n    Thanks for this post and this thread OP! You are right, making and maintening friends after college and once the \"real life\" start is hard. How did your match went on Boo? Did you meet in person?\n  "},
{"text": "\n    My pleasure! I really didn't expect that my post would become so lively, ha! So now in comparison (although it's been only one day lol) Boo is much more alive than Bumble. I've already got like 4 matches. The conversations are a bit stiff, but I think it's normal for the beginning. Overall, I'm happy I tried!\n  "},
{"text": "\n    I am from Poland too. Does this bumble bff thing work here as well?\n  "},
{"text": "\n    It does actually! You just give the access to your location. However, I think I'd recommend Boo. It's almost like Reddit lol. You create your profile, there's a very advanced personality quiz, and you have communities like here!\n  "},
{"text": "\n    Try meetup.com great way to find friends with common interests.  They literally have groups for hiking, biking, dancing, book clubs, etc.\n  "},
{"text": "\n    My sister's fiance says this is why he still uses Tinder 😬\n  "},
{"text": "\n    It's called \"going outside\" lol Jesus, people.\n  "},
{"text": "\n    20 years of technology erased 100's of culture and community/communication\n  "},
{"text": "\n    Ikr! But I bet my partner wouldn’t like me browsing people for “friends”\n  "},
{"text": "\n    I told my bf straightaway yesterday that I set up an account on Bumble. Today he even created one on Boo to go through a personality quiz 😂 Looking for friends can be a new topic for you and your partner - that's what it partially became for us. Communication is the key ❤️\n  "},
{"text": "\n    Wife and I (35+ male) just had this discussion. We grew up watching shows with characters with a large friend group that always talked, texted, and hung out. Would do anything for each other. I don’t know a single person this is true for, esp at my age. So I’ve become depressed at finding friends, bc old friends, who I thought were good, just don’t fit that anymore.\n  "},
{"text": "\n    We’re we sold this idea that is unattainable? Similar to body images?\n  "},
{"text": "\n    All those dating apps have bff modes. Also there’s this app called meetup that posts public meetups for specific niche events it’s a dope way to meet people. Also just going to gatherings/events associated with your hobbies like cons will naturally for friendships.\n  "},
{"text": "\n    I would be on board but I would be mad careful as if I were buying stuff on E-Bay\n  "},
{"text": "\n    Few more years of working and you’ll be sick of people anyhow.\n  "},
{"text": "\n    Wait for your mid thirties and you’ll understand what difficult truly means\n  "},
{"text": "\n    There is. It’s called Bumble. The settings can allow you to find only friends and not any sort of romantic/sexual relationships.\n  "},
{"text": "\n    That is so amazing for you 😄 Also, whoever invited that is genius\n  "},
{"text": "\n    I agree especially for girls wanting to make girl mates\n  "},
{"text": "\n    To be fair though, anyone in an actual romantic relationship probably isn’t going to be downloading dating apps to find friends, and even if they were, would their partner believe them?\n  "},
{"text": "\n    There needs to be one that is completely focused on friendships rather than dating, for the taken people.\n  "},
{"text": "\n    So should we tell them that there are tons of apps for this specific reason?\n  "},
{"text": "\n    I'm laughing bc it's easier to find friends in your 20's.\n  "},
{"text": "\n    Try being closer to your 50's.  Even worse if you moved a lot.  Most of my friends live out of state.\n  "},
{"text": "\n    Tinder doesn't even work for hook ups, though.\n  "},
{"text": "\n    not like tinder please lol\n  "},
{"text": "\n    Discord\n  "},
{"text": "\n    Use social media\n  "},
{"text": "\n    Oh lawd…. If women only knew what bumble bff was for men.\n  "},
{"text": "\n    Hehe. But I'm afraid that people will abuse such an app.\n  "},
{"text": "\n    It's a bit scary for me though. Someone could read my description and all the clues I've put in my profile on the app and start acting like the friend I need.\n  "},
{"text": "\n    They could be psychos. Or bad people.\n  "},
{"text": "\n    It's better to make good friends "},
{"text": "\n    I'm an introvert and recently, I had to re evaluate my friendships. You might need to, too!\n  "},
{"text": "\n    Yesss I agree\n  "},
{"text": "\n    Please check out Wyzr Friends! It’s totally new but has awesome potential.. my good friends developed it especially with safety in mind\n  "},
{"text": "\n    "},
{"text": "\n    Definitely check out the Wyzr Friends App!! It just launched and is growing fast\n  "},
{"text": "\n    Has anybody mentioned Slowly yet? It's a penpal app where you can filter people by age, location, and interests (at least in the Pro tier). No profile pictures are allowed, you can only create a comic book like avatar.\n  "},
{"text": "\n    Hangout at Walmart.\n  "},
{"text": "\n    Eww. Lol\n  "},
{"text": "\n    You don't need an app to go outside\n  "},
{"text": "\n    Ahhh yes, sure, cause everyone lives in a metropoly or has an opportunity to just go somewhere and meet people :))\n  "},
{"text": "\n    \"Pokémon Go\"-fans beg to differ!\n  "}
]